---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["mapid"]=[[暗黑之城1]],
		["monster_arr"]={"暴毒神魔1","幽灵巫师1","魔化祭司1",},
		["renwu_arr"]={"宗师装备","连环明珠","暗黑水晶","灵魂水晶","魔界残魂","帝王之心",},
		["boss1_arr"]={"毁灭巨魔",},
		["coordinate1_arr"]={93,26,}, 
	},
	[2] = {
 		["key_name"]=2,
		["mapid"]=[[暗黑之城2]],
		["monster_arr"]={"暴毒神魔2","幽灵巫师2","魔化祭司2",},
		["renwu_arr"]={"宗师装备","连环明珠","暗黑水晶","灵魂水晶","魔界残魂","帝王之心",},
		["boss1_arr"]={"毁灭巨魔",},
		["coordinate1_arr"]={93,181,}, 
	},
	[3] = {
 		["key_name"]=3,
		["mapid"]=[[暗黑之城3]],
		["monster_arr"]={"暴毒神魔3","幽灵巫师3","魔化祭司3",},
		["renwu_arr"]={"宗师装备","连环明珠","暗黑水晶","灵魂水晶","魔界残魂","帝王之心",},
		["boss1_arr"]={"毁灭巨魔",},
		["coordinate1_arr"]={39,143,}, 
	},
	[4] = {
 		["key_name"]=4,
		["mapid"]=[[暗黑之城4]],
		["monster_arr"]={"暴毒神魔4","幽灵巫师4","魔化祭司4",},
		["renwu_arr"]={"宗师装备","连环明珠","暗黑水晶","灵魂水晶","魔界残魂","帝王之心",},
		["boss1_arr"]={"毁灭巨魔",},
		["coordinate1_arr"]={112,27,}, 
	},
	[5] = {
 		["key_name"]=5,
		["mapid"]=[[暗黑之城5]],
		["monster_arr"]={"暴毒神魔5","幽灵巫师5","魔化祭司5",},
		["renwu_arr"]={"宗师装备","连环明珠","暗黑水晶","灵魂水晶","魔界残魂","帝王之心",},
		["boss1_arr"]={"忏悔之王",},
		["coordinate1_arr"]={115,170,}, 
	},
	[6] = {
 		["key_name"]=6,
		["mapid"]=[[暗黑之城6]],
		["renwu_arr"]={"宗师装备","连环明珠","暗黑水晶","灵魂水晶","魔界残魂","帝王之心",},
		["boss1_arr"]={"暗黑帝王",},
		["coordinate1_arr"]={50,57,}, 
	},  
}
 return config;