---alg工作台
---xls转lua table
---时间:Tue Jul 01 15:46:20 CST 2025
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]="材料合成",
		["item_arr"]={"风灵宝石","火灵宝石","水灵宝石","雷灵宝石","诅咒宝石","灵石","玄灵石","神灵石",}, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]="二阶飞剑",
		["item_arr"]={"二阶天神风剑","二阶霸王风剑","二阶炽热风剑","二阶神罚风剑","二阶大地风剑","二阶明月风剑","二阶山川风剑","二阶大海风剑"}, 
	},
	[3] = {
 		["key_name"]=3,
		["type"]="三阶飞剑",
		["item_arr"]={"三阶天神风剑","三阶霸王风剑","三阶炽热风剑","三阶神罚风剑","三阶大地风剑","三阶明月风剑","三阶山川风剑","三阶大海风剑"}, 
	},
	[4] = {
 		["key_name"]=4,
		["type"]="四阶飞剑",
		["item_arr"]={"四阶天神风剑","四阶霸王风剑","四阶炽热风剑","四阶神罚风剑","四阶大地风剑","四阶明月风剑","四阶山川风剑","四阶大海风剑"}, 
	},
	[5] = {
 		["key_name"]=5,
		["type"]="五阶飞剑",
		["item_arr"]={"五阶天神风剑","五阶霸王风剑","五阶炽热风剑","五阶神罚风剑","五阶大地风剑","五阶明月风剑","五阶山川风剑","五阶大海风剑"}, 
	},
	[6] = {
 		["key_name"]=6,
		["type"]="六阶飞剑",
		["item_arr"]={"六阶天神风剑","六阶霸王风剑","六阶炽热风剑","六阶神罚风剑","六阶大地风剑","六阶明月风剑","六阶山川风剑","六阶大海风剑"}, 
	},
	[7] = {
 		["key_name"]=7,
		["type"]="七阶飞剑",
		["item_arr"]={"七阶天神风剑","七阶霸王风剑","七阶炽热风剑","七阶神罚风剑","七阶大地风剑","七阶明月风剑","七阶山川风剑","七阶大海风剑"}, 
	},
	[8] = {
 		["key_name"]=8,
		["type"]="八阶飞剑",
		["item_arr"]={"八阶天神风剑","八阶霸王风剑","八阶炽热风剑","八阶神罚风剑","八阶大地风剑","八阶明月风剑","八阶山川风剑","八阶大海风剑"}, 
	},
	[9] = {
 		["key_name"]=9,
		["type"]="九阶飞剑",
		["item_arr"]={"九阶天神风剑","九阶霸王风剑","九阶炽热风剑","九阶神罚风剑","九阶大地风剑","九阶明月风剑","九阶山川风剑","九阶大海风剑"}, 
	},
	["风灵宝石"] = {
 		["key_name"]="风灵宝石",
		["odd"]=100,
		["need_config"]={{"宝石碎片",88},{"金刚石",2000},}, 
	},
	["火灵宝石"] = {
 		["key_name"]="火灵宝石",
		["odd"]=100,
		["need_config"]={{"宝石碎片",88},{"金刚石",2000},}, 
	},
	["水灵宝石"] = {
 		["key_name"]="水灵宝石",
		["odd"]=100,
		["need_config"]={{"宝石碎片",88},{"金刚石",2000},}, 
	},
	["雷灵宝石"] = {
 		["key_name"]="雷灵宝石",
		["odd"]=100,
		["need_config"]={{"宝石碎片",88},{"金刚石",2000},}, 
	},
	["诅咒宝石"] = {
 		["key_name"]="诅咒宝石",
		["odd"]=100,
		["need_config"]={{"宝石碎片",88},{"金刚石",2000},}, 
	},
	["灵石"] = {
 		["key_name"]="灵石",
		["odd"]=100,
		["need_config"]={{"宝石碎片",88},{"金刚石",2000},}, 
	},
	["玄灵石"] = {
 		["key_name"]="玄灵石",
		["odd"]=100,
		["need_config"]={{"宝石碎片",58},{"灵石",10},}, 
	},
	["神灵石"] = {
 		["key_name"]="神灵石",
		["odd"]=100,
		["need_config"]={{"宝石碎片",158},{"玄灵石",10},}, 
	},  
	["二阶天神风剑"] = {
 		["key_name"]="二阶天神风剑",
		["odd"]=100,
		["need_config"]={{"一阶天神风剑",1},{"飞剑碎片",20},}, 
	}, 
	["二阶霸王风剑"] = {
 		["key_name"]="二阶霸王风剑",
		["odd"]=100,
		["need_config"]={{"一阶霸王风剑",1},{"飞剑碎片",20},}, 
	}, 
	["二阶炽热风剑"] = {
 		["key_name"]="二阶炽热风剑",
		["odd"]=100,
		["need_config"]={{"一阶炽热风剑",1},{"飞剑碎片",20},}, 
	}, 
	["二阶神罚风剑"] = {
 		["key_name"]="二阶神罚风剑",
		["odd"]=100,
		["need_config"]={{"一阶神罚风剑",1},{"飞剑碎片",20},}, 
	}, 
	["二阶大地风剑"] = {
 		["key_name"]="二阶大地风剑",
		["odd"]=100,
		["need_config"]={{"一阶大地风剑",1},{"飞剑碎片",20},}, 
	}, 
	["二阶明月风剑"] = {
 		["key_name"]="二阶明月风剑",
		["odd"]=100,
		["need_config"]={{"一阶明月风剑",1},{"飞剑碎片",20},}, 
	}, 
	["二阶山川风剑"] = {
 		["key_name"]="二阶山川风剑",
		["odd"]=100,
		["need_config"]={{"一阶山川风剑",1},{"飞剑碎片",20},}, 
	},
	["二阶大海风剑"] = {
 		["key_name"]="二阶大海风剑",
		["odd"]=100,
		["need_config"]={{"一阶大海风剑",1},{"飞剑碎片",20},}, 
	},
	["三阶天神风剑"] = {
 		["key_name"]="三阶天神风剑",
		["odd"]=100,
		["need_config"]={{"二阶天神风剑",1},{"飞剑碎片",30},}, 
	}, 
	["三阶霸王风剑"] = {
 		["key_name"]="三阶霸王风剑",
		["odd"]=100,
		["need_config"]={{"二阶霸王风剑",1},{"飞剑碎片",30},}, 
	}, 
	["三阶炽热风剑"] = {
 		["key_name"]="三阶炽热风剑",
		["odd"]=100,
		["need_config"]={{"二阶炽热风剑",1},{"飞剑碎片",30},}, 
	}, 
	["三阶神罚风剑"] = {
 		["key_name"]="三阶神罚风剑",
		["odd"]=100,
		["need_config"]={{"二阶神罚风剑",1},{"飞剑碎片",30},}, 
	}, 
	["三阶大地风剑"] = {
 		["key_name"]="三阶大地风剑",
		["odd"]=100,
		["need_config"]={{"二阶大地风剑",1},{"飞剑碎片",30},}, 
	}, 
	["三阶明月风剑"] = {
 		["key_name"]="三阶明月风剑",
		["odd"]=100,
		["need_config"]={{"二阶明月风剑",1},{"飞剑碎片",30},}, 
	}, 
	["三阶山川风剑"] = {
 		["key_name"]="二阶山川风剑",
		["odd"]=100,
		["need_config"]={{"二阶山川风剑",1},{"飞剑碎片",30},}, 
	},
	["三阶大海风剑"] = {
 		["key_name"]="三阶大海风剑",
		["odd"]=100,
		["need_config"]={{"二阶大海风剑",1},{"飞剑碎片",30},}, 
	},
	["四阶天神风剑"] = {
 		["key_name"]="四阶天神风剑",
		["odd"]=100,
		["need_config"]={{"三阶天神风剑",1},{"飞剑碎片",40},}, 
	}, 
	["四阶霸王风剑"] = {
 		["key_name"]="四阶霸王风剑",
		["odd"]=100,
		["need_config"]={{"三阶霸王风剑",1},{"飞剑碎片",40},}, 
	}, 
	["四阶炽热风剑"] = {
 		["key_name"]="四阶炽热风剑",
		["odd"]=100,
		["need_config"]={{"三阶炽热风剑",1},{"飞剑碎片",40},}, 
	}, 
	["四阶神罚风剑"] = {
 		["key_name"]="四阶神罚风剑",
		["odd"]=100,
		["need_config"]={{"三阶神罚风剑",1},{"飞剑碎片",40},}, 
	}, 
	["四阶大地风剑"] = {
 		["key_name"]="四阶大地风剑",
		["odd"]=100,
		["need_config"]={{"三阶大地风剑",1},{"飞剑碎片",40},}, 
	}, 
	["四阶明月风剑"] = {
 		["key_name"]="四阶明月风剑",
		["odd"]=100,
		["need_config"]={{"三阶明月风剑",1},{"飞剑碎片",40},}, 
	}, 
	["四阶山川风剑"] = {
 		["key_name"]="四阶山川风剑",
		["odd"]=100,
		["need_config"]={{"三阶山川风剑",1},{"飞剑碎片",40},}, 
	},
	["四阶大海风剑"] = {
 		["key_name"]="四阶大海风剑",
		["odd"]=100,
		["need_config"]={{"三阶大海风剑",1},{"飞剑碎片",40},}, 
	},
	["五阶天神风剑"] = {
 		["key_name"]="五阶天神风剑",
		["odd"]=100,
		["need_config"]={{"四阶天神风剑",1},{"飞剑碎片",50},}, 
	}, 
	["五阶霸王风剑"] = {
 		["key_name"]="五阶霸王风剑",
		["odd"]=100,
		["need_config"]={{"四阶霸王风剑",1},{"飞剑碎片",50},}, 
	}, 
	["五阶炽热风剑"] = {
 		["key_name"]="五阶炽热风剑",
		["odd"]=100,
		["need_config"]={{"四阶炽热风剑",1},{"飞剑碎片",50},}, 
	}, 
	["五阶神罚风剑"] = {
 		["key_name"]="五阶神罚风剑",
		["odd"]=100,
		["need_config"]={{"四阶神罚风剑",1},{"飞剑碎片",50},}, 
	}, 
	["五阶大地风剑"] = {
 		["key_name"]="五阶大地风剑",
		["odd"]=100,
		["need_config"]={{"四阶大地风剑",1},{"飞剑碎片",50},}, 
	}, 
	["五阶明月风剑"] = {
 		["key_name"]="五阶明月风剑",
		["odd"]=100,
		["need_config"]={{"四阶明月风剑",1},{"飞剑碎片",50},}, 
	}, 
	["五阶山川风剑"] = {
 		["key_name"]="五阶山川风剑",
		["odd"]=100,
		["need_config"]={{"四阶山川风剑",1},{"飞剑碎片",50},}, 
	},
	["五阶大海风剑"] = {
 		["key_name"]="五阶大海风剑",
		["odd"]=100,
		["need_config"]={{"四阶大海风剑",1},{"飞剑碎片",50},}, 
	},
	["六阶天神风剑"] = {
 		["key_name"]="六阶天神风剑",
		["odd"]=100,
		["need_config"]={{"五阶天神风剑",1},{"飞剑碎片",60},}, 
	}, 
	["六阶霸王风剑"] = {
 		["key_name"]="六阶霸王风剑",
		["odd"]=100,
		["need_config"]={{"五阶霸王风剑",1},{"飞剑碎片",60},}, 
	}, 
	["六阶炽热风剑"] = {
 		["key_name"]="六阶炽热风剑",
		["odd"]=100,
		["need_config"]={{"五阶炽热风剑",1},{"飞剑碎片",60},}, 
	}, 
	["六阶神罚风剑"] = {
 		["key_name"]="六阶神罚风剑",
		["odd"]=100,
		["need_config"]={{"五阶神罚风剑",1},{"飞剑碎片",60},}, 
	}, 
	["六阶大地风剑"] = {
 		["key_name"]="六阶大地风剑",
		["odd"]=100,
		["need_config"]={{"五阶大地风剑",1},{"飞剑碎片",60},}, 
	}, 
	["六阶明月风剑"] = {
 		["key_name"]="六阶明月风剑",
		["odd"]=100,
		["need_config"]={{"五阶明月风剑",1},{"飞剑碎片",60},}, 
	}, 
	["六阶山川风剑"] = {
 		["key_name"]="六阶山川风剑",
		["odd"]=100,
		["need_config"]={{"五阶山川风剑",1},{"飞剑碎片",60},}, 
	},
	["六阶大海风剑"] = {
 		["key_name"]="六阶大海风剑",
		["odd"]=100,
		["need_config"]={{"五阶大海风剑",1},{"飞剑碎片",60},}, 
	},
	["七阶天神风剑"] = {
 		["key_name"]="七阶天神风剑",
		["odd"]=100,
		["need_config"]={{"六阶天神风剑",1},{"飞剑碎片",70},}, 
	}, 
	["七阶霸王风剑"] = {
 		["key_name"]="七阶霸王风剑",
		["odd"]=100,
		["need_config"]={{"六阶霸王风剑",1},{"飞剑碎片",70},}, 
	}, 
	["七阶炽热风剑"] = {
 		["key_name"]="七阶炽热风剑",
		["odd"]=100,
		["need_config"]={{"六阶炽热风剑",1},{"飞剑碎片",70},}, 
	}, 
	["七阶神罚风剑"] = {
 		["key_name"]="七阶神罚风剑",
		["odd"]=100,
		["need_config"]={{"六阶神罚风剑",1},{"飞剑碎片",70},}, 
	}, 
	["七阶大地风剑"] = {
 		["key_name"]="六阶大地风剑",
		["odd"]=100,
		["need_config"]={{"六阶大地风剑",1},{"飞剑碎片",70},}, 
	}, 
	["七阶明月风剑"] = {
 		["key_name"]="七阶明月风剑",
		["odd"]=100,
		["need_config"]={{"六阶明月风剑",1},{"飞剑碎片",70},}, 
	}, 
	["七阶山川风剑"] = {
 		["key_name"]="七阶山川风剑",
		["odd"]=100,
		["need_config"]={{"六阶山川风剑",1},{"飞剑碎片",70},}, 
	},
	["七阶大海风剑"] = {
 		["key_name"]="七阶大海风剑",
		["odd"]=100,
		["need_config"]={{"六阶大海风剑",1},{"飞剑碎片",70},}, 
	},
	["八阶天神风剑"] = {
 		["key_name"]="八阶天神风剑",
		["odd"]=100,
		["need_config"]={{"七阶天神风剑",1},{"飞剑碎片",80},}, 
	}, 
	["八阶霸王风剑"] = {
 		["key_name"]="八阶霸王风剑",
		["odd"]=100,
		["need_config"]={{"七阶霸王风剑",1},{"飞剑碎片",80},}, 
	}, 
	["八阶炽热风剑"] = {
 		["key_name"]="八阶炽热风剑",
		["odd"]=100,
		["need_config"]={{"七阶炽热风剑",1},{"飞剑碎片",80},}, 
	}, 
	["八阶神罚风剑"] = {
 		["key_name"]="八阶神罚风剑",
		["odd"]=100,
		["need_config"]={{"七阶神罚风剑",1},{"飞剑碎片",80},}, 
	}, 
	["八阶大地风剑"] = {
 		["key_name"]="八阶大地风剑",
		["odd"]=100,
		["need_config"]={{"七阶大地风剑",1},{"飞剑碎片",80},}, 
	}, 
	["八阶明月风剑"] = {
 		["key_name"]="八阶明月风剑",
		["odd"]=100,
		["need_config"]={{"七阶明月风剑",1},{"飞剑碎片",80},}, 
	}, 
	["八阶山川风剑"] = {
 		["key_name"]="八阶山川风剑",
		["odd"]=100,
		["need_config"]={{"七阶山川风剑",1},{"飞剑碎片",80},}, 
	},
	["八阶大海风剑"] = {
 		["key_name"]="八阶大海风剑",
		["odd"]=100,
		["need_config"]={{"七阶大海风剑",1},{"飞剑碎片",80},}, 
	},
	["九阶天神风剑"] = {
 		["key_name"]="九阶天神风剑",
		["odd"]=100,
		["need_config"]={{"八阶天神风剑",1},{"飞剑碎片",90},}, 
	}, 
	["九阶霸王风剑"] = {
 		["key_name"]="九阶霸王风剑",
		["odd"]=100,
		["need_config"]={{"八阶霸王风剑",1},{"飞剑碎片",90},}, 
	}, 
	["九阶炽热风剑"] = {
 		["key_name"]="九阶炽热风剑",
		["odd"]=100,
		["need_config"]={{"八阶炽热风剑",1},{"飞剑碎片",90},}, 
	}, 
	["九阶神罚风剑"] = {
 		["key_name"]="九阶神罚风剑",
		["odd"]=100,
		["need_config"]={{"八阶神罚风剑",1},{"飞剑碎片",90},}, 
	}, 
	["九阶大地风剑"] = {
 		["key_name"]="九阶大地风剑",
		["odd"]=100,
		["need_config"]={{"八阶大地风剑",1},{"飞剑碎片",90},}, 
	}, 
	["九阶明月风剑"] = {
 		["key_name"]="九阶明月风剑",
		["odd"]=100,
		["need_config"]={{"八阶明月风剑",1},{"飞剑碎片",90},}, 
	}, 
	["九阶山川风剑"] = {
 		["key_name"]="九阶山川风剑",
		["odd"]=100,
		["need_config"]={{"八阶山川风剑",1},{"飞剑碎片",90},}, 
	},
	["九阶大海风剑"] = {
 		["key_name"]="九阶大海风剑",
		["odd"]=100,
		["need_config"]={{"八阶大海风剑",1},{"飞剑碎片",90},}, 
	},
}
 return config;