---alg工作台
---xls转lua table
---时间:Wed Jun 25 16:27:54 CST 2025
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]="战神装备",
		["equip_arr"]={"开天","镇天","玄天","凤天魔甲","凰天魔衣",},
		["all_arr"]={"开天","镇天","玄天","凤天魔甲","凰天魔衣",},
		["award_map"]={["宝石碎片"]=5,["灵石"]=1,["金刚石"]=10,}, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]="火龙装备",
		["equip_arr"]={"火龙战刃","火龙魔刃","火龙道刃","火龙神甲","火龙神袍",},
		["all_arr"]={"火龙战刃","火龙魔刃","火龙道刃","火龙神甲","火龙神袍",},
		["award_map"]={["宝石碎片"]=10,["玄灵石"]=1,["金刚石"]=30,}, 
	},
	[3] = {
 		["key_name"]=3,
		["type"]="天龙装备",
		["equip_arr"]={"天龙战刃","天龙魔刃","天龙道刃","天龙神甲","天龙神袍",},
		["all_arr"]={"天龙战刃","天龙魔刃","天龙道刃","天龙神甲","天龙神袍",},
		["award_map"]={["宝石碎片"]=20,["玄灵石"]=2,["金刚石"]=50,}, 
	},
	[4] = {
 		["key_name"]=4,
		["type"]="神龙装备",
		["equip_arr"]={"神龙战刃","神龙魔刃","神龙道刃","神龙神甲","神龙神袍",},
		["all_arr"]={"神龙战刃","神龙魔刃","神龙道刃","神龙神甲","神龙神袍",},
		["award_map"]={["宝石碎片"]=40,["神灵石"]=1,["金刚石"]=100,}, 
	},
	[5] = {
 		["key_name"]=5,
		["type"]="聖龍装备",
		["equip_arr"]={"聖龍装备(战)","聖龍装备(法)","聖龍装备(道)","聖龍战链","聖龍魔链","聖龍道链",},
		["all_arr"]={"聖龍战盔","聖龍战链","聖龍战镯","聖龍战戒","聖龍战带","聖龍战靴","聖龍魔盔","聖龍魔链","聖龍魔镯","聖龍魔戒","聖龍魔带","聖龍魔靴","聖龍道盔","聖龍道链","聖龍道镯","聖龍道戒","聖龍道带","聖龍道靴","聖龍战链","聖龍魔链","聖龍道链",},
		["award_map"]={["宝石碎片"]=80,["神灵石"]=2,["金刚石"]=500,},
		["special_arr1"]={"聖龍战盔","聖龍战链","聖龍战镯","聖龍战戒","聖龍战带","聖龍战靴",},
		["special_arr2"]={"聖龍魔盔","聖龍魔链","聖龍魔镯","聖龍魔戒","聖龍魔带","聖龍魔靴",},
		["special_arr3"]={"聖龍道盔","聖龍道链","聖龍道镯","聖龍道戒","聖龍道带","聖龍道靴",}, 
	},  
	[6] = {
 		["key_name"]=6,
		["type"]="一阶飞剑",
		["equip_arr"]={"一阶天神风剑","一阶霸王风剑","一阶炽热风剑","一阶神罚风剑","一阶大地风剑","一阶明月风剑","一阶山川风剑","一阶大海风剑",},
		["all_arr"]={"一阶天神风剑","一阶霸王风剑","一阶炽热风剑","一阶神罚风剑","一阶大地风剑","一阶明月风剑","一阶山川风剑","一阶大海风剑",},
		["award_map"]={["飞剑碎片"]=10,},
	}, 
	[7] = {
 		["key_name"]=7,
		["type"]="二阶飞剑",
		["equip_arr"]={"二阶天神风剑","二阶霸王风剑","二阶炽热风剑","二阶神罚风剑","二阶大地风剑","二阶明月风剑","二阶山川风剑","二阶大海风剑"},
		["all_arr"]={"二阶天神风剑","二阶霸王风剑","二阶炽热风剑","二阶神罚风剑","二阶大地风剑","二阶明月风剑","二阶山川风剑","二阶大海风剑"},
		["award_map"]={["飞剑碎片"]=10,},
	}, 
	[8] = {
 		["key_name"]=8,
		["type"]="三阶飞剑",
		["equip_arr"]={"三阶天神风剑","三阶霸王风剑","三阶炽热风剑","三阶神罚风剑","三阶大地风剑","三阶明月风剑","三阶山川风剑","三阶大海风剑"},
		["all_arr"]={"三阶天神风剑","三阶霸王风剑","三阶炽热风剑","三阶神罚风剑","三阶大地风剑","三阶明月风剑","三阶山川风剑","三阶大海风剑"},
		["award_map"]={["飞剑碎片"]=15,},
	},  
	[9] = {
 		["key_name"]=9,
		["type"]="四阶飞剑",
		["equip_arr"]={"四阶天神风剑","四阶霸王风剑","四阶炽热风剑","四阶神罚风剑","四阶大地风剑","四阶明月风剑","四阶山川风剑","四阶大海风剑"},
		["all_arr"]={"四阶天神风剑","四阶霸王风剑","四阶炽热风剑","四阶神罚风剑","四阶大地风剑","四阶明月风剑","四阶山川风剑","四阶大海风剑"},
		["award_map"]={["飞剑碎片"]=20,},
	}, 
	[10] = {
 		["key_name"]=10,
		["type"]="五阶飞剑",
		["equip_arr"]={"五阶天神风剑","五阶霸王风剑","五阶炽热风剑","五阶神罚风剑","五阶大地风剑","五阶明月风剑","五阶山川风剑","五阶大海风剑"},
		["all_arr"]={"五阶天神风剑","五阶霸王风剑","五阶炽热风剑","五阶神罚风剑","五阶大地风剑","五阶明月风剑","五阶山川风剑","五阶大海风剑"},
		["award_map"]={["飞剑碎片"]=25,},
	}, 
	[11] = {
 		["key_name"]=11,
		["type"]="六阶飞剑",
		["equip_arr"]={"六阶天神风剑","六阶霸王风剑","六阶炽热风剑","六阶神罚风剑","六阶大地风剑","六阶明月风剑","六阶山川风剑","六阶大海风剑"},
		["all_arr"]={"六阶天神风剑","六阶霸王风剑","六阶炽热风剑","六阶神罚风剑","六阶大地风剑","六阶明月风剑","六阶山川风剑","六阶大海风剑"},
		["award_map"]={["飞剑碎片"]=30,},
	}, 
	[12] = {
 		["key_name"]=12,
		["type"]="七阶飞剑",
		["equip_arr"]={"七阶天神风剑","七阶霸王风剑","七阶炽热风剑","七阶神罚风剑","七阶大地风剑","七阶明月风剑","七阶山川风剑","七阶大海风剑"},
		["all_arr"]={"七阶天神风剑","七阶霸王风剑","七阶炽热风剑","七阶神罚风剑","七阶大地风剑","七阶明月风剑","七阶山川风剑","七阶大海风剑"},
		["award_map"]={["飞剑碎片"]=35,},
	}, 
	[13] = {
 		["key_name"]=13,
		["type"]="八阶飞剑",
		["equip_arr"]={"八阶天神风剑","八阶霸王风剑","八阶炽热风剑","八阶神罚风剑","八阶大地风剑","八阶明月风剑","八阶山川风剑","八阶大海风剑"},
		["all_arr"]={"八阶天神风剑","八阶霸王风剑","八阶炽热风剑","八阶神罚风剑","八阶大地风剑","八阶明月风剑","八阶山川风剑","八阶大海风剑"},
		["award_map"]={["飞剑碎片"]=40,},
	}, 
	[14] = {
 		["key_name"]=14,
		["type"]="九阶飞剑",
		["equip_arr"]={"九阶天神风剑","九阶霸王风剑","九阶炽热风剑","九阶神罚风剑","九阶大地风剑","九阶明月风剑","九阶山川风剑","九阶大海风剑"},
		["all_arr"]={"九阶天神风剑","九阶霸王风剑","九阶炽热风剑","九阶神罚风剑","九阶大地风剑","九阶明月风剑","九阶山川风剑","九阶大海风剑"},
		["award_map"]={["飞剑碎片"]=45,},
	}, 
}
 return config;