---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]="次元解封(战)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师战刃"]=2,},
		["name"]="异次元:宗师战刃", 
	},
	[2] = {
 		["key_name"]=2,
		["type"]="次元解封(战)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师神甲"]=2,},
		["name"]="异次元:宗师神甲", 
	},
	[3] = {
 		["key_name"]=3,
		["type"]="次元解封(战)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师神袍"]=2,},
		["name"]="异次元:宗师神袍", 
	},
	[4] = {
 		["key_name"]=4,
		["type"]="次元解封(战)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师战盔"]=2,},
		["name"]="异次元:宗师战盔", 
	},
	[5] = {
 		["key_name"]=5,
		["type"]="次元解封(战)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师战链"]=2,},
		["name"]="异次元:宗师战链", 
	},
	[6] = {
 		["key_name"]=6,
		["type"]="次元解封(战)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师战镯"]=2,},
		["name"]="异次元:宗师战镯", 
	},
	[7] = {
 		["key_name"]=7,
		["type"]="次元解封(战)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师战戒"]=2,},
		["name"]="异次元:宗师战戒", 
	},
	[8] = {
 		["key_name"]=8,
		["type"]="次元解封(战)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师战带"]=2,},
		["name"]="异次元:宗师战带", 
	},
	[9] = {
 		["key_name"]=9,
		["type"]="次元解封(战)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师战靴"]=2,},
		["name"]="异次元:宗师战靴", 
	},
	[10] = {
 		["key_name"]=10,
		["type"]="次元解封(法)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师魔刃"]=2,},
		["name"]="异次元:宗师魔刃", 
	},
	[11] = {
 		["key_name"]=11,
		["type"]="次元解封(法)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师神甲"]=2,},
		["name"]="异次元:宗师神甲", 
	},
	[12] = {
 		["key_name"]=12,
		["type"]="次元解封(法)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师神袍"]=2,},
		["name"]="异次元:宗师神袍", 
	},
	[13] = {
 		["key_name"]=13,
		["type"]="次元解封(法)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师魔盔"]=2,},
		["name"]="异次元:宗师魔盔", 
	},
	[14] = {
 		["key_name"]=14,
		["type"]="次元解封(法)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师魔链"]=2,},
		["name"]="异次元:宗师魔链", 
	},
	[15] = {
 		["key_name"]=15,
		["type"]="次元解封(法)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师魔镯"]=2,},
		["name"]="异次元:宗师魔镯", 
	},
	[16] = {
 		["key_name"]=16,
		["type"]="次元解封(法)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师魔戒"]=2,},
		["name"]="异次元:宗师魔戒", 
	},
	[17] = {
 		["key_name"]=17,
		["type"]="次元解封(法)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师魔带"]=2,},
		["name"]="异次元:宗师魔带", 
	},
	[18] = {
 		["key_name"]=18,
		["type"]="次元解封(法)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师魔靴"]=2,},
		["name"]="异次元:宗师魔靴", 
	},
	[19] = {
 		["key_name"]=19,
		["type"]="次元解封(道)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师道刃"]=2,},
		["name"]="异次元:宗师道刃", 
	},
	[20] = {
 		["key_name"]=20,
		["type"]="次元解封(道)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师神甲"]=2,},
		["name"]="异次元:宗师神甲", 
	},
	[21] = {
 		["key_name"]=21,
		["type"]="次元解封(道)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师神袍"]=2,},
		["name"]="异次元:宗师神袍", 
	},
	[22] = {
 		["key_name"]=22,
		["type"]="次元解封(道)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师道盔"]=2,},
		["name"]="异次元:宗师道盔", 
	},
	[23] = {
 		["key_name"]=23,
		["type"]="次元解封(道)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师道链"]=2,},
		["name"]="异次元:宗师道链", 
	},
	[24] = {
 		["key_name"]=24,
		["type"]="次元解封(道)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师道镯"]=2,},
		["name"]="异次元:宗师道镯", 
	},
	[25] = {
 		["key_name"]=25,
		["type"]="次元解封(道)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师道戒"]=2,},
		["name"]="异次元:宗师道戒", 
	},
	[26] = {
 		["key_name"]=26,
		["type"]="次元解封(道)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师道带"]=2,},
		["name"]="异次元:宗师道带", 
	},
	[27] = {
 		["key_name"]=27,
		["type"]="次元解封(道)",
		["need_map"]={["异界水晶"]=99,["灵符"]=10000,["宗师道靴"]=2,},
		["name"]="异次元:宗师道靴", 
	},  
}
 return config;