---alg工作台
---xls转lua table
---时间:Wed Jul 09 16:36:47 CST 2025
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["Name"]="神龙脊",
		["nedd_map"]={["神龙脊[残]"]=1,["龙之心"]=999,["龙之血"]=999,["金刚石"]=100000,},
		["map"]="西沙海底-书院",
		["boss"]="魔界神龙", 
	},
	[2] = {
 		["key_name"]=2,
		["Name"]="飞龙皮",
		["nedd_map"]={["飞龙皮[残]"]=1,["龙之心"]=999,["龙之血"]=999,["金刚石"]=100000,},
		["map"]="死亡之岛-禁地",
		["boss"]="魔界飞龙", 
	},
	[3] = {
 		["key_name"]=3,
		["Name"]="暗龙角",
		["nedd_map"]={["暗龙角[残]"]=1,["龙之心"]=999,["龙之血"]=999,["金刚石"]=50000,},
		["map"]="失乐森林-魔宫",
		["boss"]="魔界暗龙", 
	},
	[4] = {
 		["key_name"]=4,
		["Name"]="天龙眼",
		["nedd_map"]={["天龙眼[残]"]=1,["龙之心"]=999,["龙之血"]=999,["金刚石"]=50000,},
		["map"]="骨魔洞穴-坟场",
		["boss"]="魔界恶龙", 
	},
	[5] = {
 		["key_name"]=5,
		["Name"]="邪龙爪",
		["nedd_map"]={["邪龙爪[残]"]=1,["龙之心"]=999,["龙之血"]=999,["金刚石"]=50000,},
		["map"]="潘夜神庙-神殿",
		["boss"]="魔界邪龙", 
	},
	[6] = {
 		["key_name"]=6,
		["Name"]="苍龙骨",
		["nedd_map"]={["苍龙骨[残]"]=1,["龙之心"]=999,["龙之血"]=999,["金刚石"]=50000,},
		["map"]="尸魔禁地-祭坛",
		["boss"]="魔界苍龙", 
	},
	[7] = {
 		["key_name"]=7,
		["Name"]="炎龙羽",
		["nedd_map"]={["炎龙羽[残]"]=1,["龙之心"]=999,["龙之血"]=999,["金刚石"]=50000,},
		["map"]="苍月岛隐藏地图",
		["boss"]="魔界炎龙", 
	},
	[8] = {
 		["key_name"]=8,
		["Name"]="恶龙鳞",
		["nedd_map"]={["恶龙鳞[残]"]=1,["龙之心"]=999,["龙之血"]=999,["金刚石"]=50000,},
		["map"]="苍月岛隐藏地图",
		["boss"]="魔界天龙", 
	},  
}
 return config;