---alg工作台
---xls转lua table
---时间:Wed Jul 16 12:02:28 CST 2025
---本工具免费 交流QQ群:436063587
local config = {
	[1] = {
 		["key_name"]=1,
		["type"]="祖玛首饰(无)",
	},
	[2] = {
 		["key_name"]=2,
		["type"]="赤月系列",
	},
	[3] = {
 		["key_name"]=3,
		["type"]="雷霆系列",
		["equip_list"]={"雷霆腰带","雷霆战靴","圣龙盔","雷霆项链","雷霆护腕","雷霆战戒","魔龙盔","烈焰项链","烈焰魔戒","烈焰护腕","烈焰魔靴","烈焰腰带","天龙盔","光芒项链","光芒道戒","光芒护腕","光芒道靴","光芒腰带","屠龙","噬魂法杖","霸者之刃","雷霆战甲(男)","光芒道袍(男)","烈焰魔衣(男)","雷霆战甲(女)","光芒道袍(女)","烈焰魔衣(女)",}, 
	},
	[4] = {
 		["key_name"]=4,
		["type"]="强化系列",
		["equip_list"]={"强化圣龙盔","强化雷霆项链","强化雷霆护腕","强化雷霆战戒","强化雷霆腰带","强化雷霆战靴","强化烈焰护腕","强化烈焰魔戒","强化烈焰魔靴","强化烈焰腰带","强化魔龙盔","强化烈焰项链","强化光芒护腕","强化光芒道戒","强化光芒道靴","强化光芒腰带","强化天龙盔","强化光芒项链","黄金屠龙","紫金噬魂法杖","赤金逍遥扇",}, 
	},
	[5] = {
 		["key_name"]=5,
		["type"]="战神首饰",
		["equip_list"]={"战神头盔","战神项链","战神手镯","战神戒指","战神圣靴",}, 
	},
	[6] = {
 		["key_name"]=6,
		["type"]="圣魔首饰",
		["equip_list"]={"圣魔头盔","圣魔项链","圣魔手镯","圣魔戒指","圣魔腰带","圣魔法靴",}, 
	},
	[7] = {
 		["key_name"]=7,
		["type"]="真魂首饰",
		["equip_list"]={"真魂头盔","真魂项链","真魂手镯","真魂戒指","真魂腰带","真魂道靴",}, 
	},
	[8] = {
 		["key_name"]=8,
		["type"]="火龙战首饰",
		["equip_list"]={"火龙战盔","火龙战链","火龙战镯","火龙战戒","火龙战靴","火龙战带",}, 
	},
	[9] = {
 		["key_name"]=9,
		["type"]="火龙魔首饰",
		["equip_list"]={"火龙魔盔","火龙魔链","火龙魔镯","火龙魔戒","火龙魔靴","火龙魔带",}, 
	},
	[10] = {
 		["key_name"]=10,
		["type"]="火龙道首饰",
		["equip_list"]={"火龙道盔","火龙道链","火龙道镯","火龙道戒","火龙道靴","火龙道带",}, 
	},
	[11] = {
 		["key_name"]=11,
		["type"]="天龙战首饰",
		["equip_list"]={"天龙战盔","天龙战链","天龙战镯","天龙战戒","天龙战带","天龙战靴",}, 
	},
	[12] = {
 		["key_name"]=12,
		["type"]="天龙魔首饰",
		["equip_list"]={"天龙魔盔","天龙魔链","天龙魔镯","天龙魔戒","天龙魔带","天龙魔靴",}, 
	},
	[13] = {
 		["key_name"]=13,
		["type"]="天龙道首饰",
		["equip_list"]={"天龙道盔","天龙道链","天龙道镯","天龙道戒","天龙道带","天龙道靴",}, 
	},
	[14] = {
 		["key_name"]=14,
		["type"]="神龙战首饰",
		["equip_list"]={"神龙战盔","神龙战链","神龙战镯","神龙战戒","神龙战带","神龙战靴",}, 
	},
	[15] = {
 		["key_name"]=15,
		["type"]="神龙魔首饰",
		["equip_list"]={"神龙魔盔","神龙魔链","神龙魔镯","神龙魔戒","神龙魔带","神龙魔靴",}, 
	},
	[16] = {
 		["key_name"]=16,
		["type"]="神龙道首饰",
		["equip_list"]={"神龙道盔","神龙道链","神龙道镯","神龙道戒","神龙道带","神龙道靴",}, 
	},
	[17] = {
 		["key_name"]=17,
		["type"]="聖龍战首饰",
		["equip_list"]={"聖龍战盔","聖龍战链","聖龍战镯","聖龍战戒","聖龍战带","聖龍战靴",}, 
	},
	[18] = {
 		["key_name"]=18,
		["type"]="聖龍魔首饰",
		["equip_list"]={"聖龍魔盔","聖龍魔链","聖龍魔镯","聖龍魔戒","聖龍魔带","聖龍魔靴",}, 
	},
	[19] = {
 		["key_name"]=19,
		["type"]="聖龍道首饰",
		["equip_list"]={"聖龍道盔","聖龍道链","聖龍道镯","聖龍道戒","聖龍道带","聖龍道靴",}, 
	},
	[20] = {
 		["key_name"]=20,
		["type"]="宗师战首饰",
		["equip_list"]={"宗师战盔","宗师战链","宗师战镯","宗师战戒","宗师战带","宗师战靴",}, 
	},
	[21] = {
 		["key_name"]=21,
		["type"]="宗师魔首饰",
		["equip_list"]={"宗师魔盔","宗师魔链","宗师魔镯","宗师魔戒","宗师魔带","宗师魔靴",}, 
	},
	[22] = {
 		["key_name"]=22,
		["type"]="宗师道首饰",
		["equip_list"]={"宗师道盔","宗师道链","宗师道镯","宗师道戒","宗师道带","宗师道靴",}, 
	},
	[23] = {
 		["key_name"]=23,
		["type"]="宗师战圣",
		["equip_list"]={"宗师战盔·圣","宗师战链·圣","宗师战镯·圣","宗师战戒·圣","宗师战带·圣","宗师战靴·圣",}, 
	},
	[24] = {
 		["key_name"]=24,
		["type"]="宗师魔圣",
		["equip_list"]={"宗师魔盔·圣","宗师魔链·圣","宗师魔镯·圣","宗师魔戒·圣","宗师魔带·圣","宗师魔靴·圣",}, 
	},
	[25] = {
 		["key_name"]=25,
		["type"]="宗师道圣",
		["equip_list"]={"宗师道盔·圣","宗师道链·圣","宗师道镯·圣","宗师道戒·圣","宗师道带·圣","宗师道靴·圣",}, 
	},
	[26] = {
 		["key_name"]=26,
		["type"]="战神剑甲",
		["equip_list"]={"开天","镇天","玄天","凤天魔甲","凰天魔衣",}, 
	},
	
	[27] = {
 		["key_name"]=27,
		["type"]="火龙剑甲",
		["equip_list"]={"火龙战刃","火龙魔刃","火龙道刃","火龙神甲","火龙神袍",}, 
	},
	[28] = {
 		["key_name"]=28,
		["type"]="天龙剑甲",
		["equip_list"]={"天龙战刃","天龙魔刃","天龙道刃","天龙神甲","天龙神袍",}, 
	},
	[29] = {
 		["key_name"]=29,
		["type"]="神龙剑甲",
		["equip_list"]={"神龙战刃","神龙魔刃","神龙道刃","神龙神甲","神龙神袍",}, 
	},
	[30] = {
 		["key_name"]=30,
		["type"]="聖龍剑甲",
		["equip_list"]={"聖龍战刃","聖龍魔刃","聖龍道刃","聖龍神甲","聖龍神袍",}, 
	},
	[31] = {
 		["key_name"]=31,
		["type"]="宗师剑甲",
		["equip_list"]={"宗师战刃","宗师魔刃","宗师道刃","宗师神甲","宗师神袍",}, 
	},
	[32] = {
 		["key_name"]=32,
		["type"]="宗师剑甲圣",
		["equip_list"]={"宗师战刃·圣","宗师魔刃·圣","宗师道刃·圣","宗师神甲·圣","宗师神袍·圣",}, 
	},
	[33] = {
 		["key_name"]=33,
		["type"]="魔血石",
		["equip_list"]={"一星魔血石","二星魔血石","三星魔血石","四星魔血石","五星魔血石","六星魔血石","七星魔血石","八星魔血石","九星魔血石","魔血石·MAX",}, 
	},
	[34] = {
 		["key_name"]=34,
		["type"]="斗笠",
		["equip_list"]={"祖玛斗笠","赤月斗笠","魔龙斗笠","战神斗笠","火龙斗笠","天龙斗笠","神龙斗笠","聖龍斗笠","宗师斗笠","宗师斗笠·圣",}, 
	},
	[35] = {
 		["key_name"]=35,
		["type"]="盾牌",
		["equip_list"]={"祖玛盾牌","赤月盾牌","魔龙盾牌","战神盾牌","火龙盾牌","天龙盾牌","神龙盾牌","聖龍盾牌","宗师盾牌",}, 
	},
	[36] = {
 		["key_name"]=36,
		["type"]="勋章",
		["equip_list"]={"祖玛勋章","赤月勋章","魔龙勋章","战神勋章","火龙勋章","天龙勋章","聖龍勋章","宗师勋章",}, 
	},
	[37] = {
 		["key_name"]=37,
		["type"]="神符",
		["equip_list"]={"祖玛兵符","赤月兵符","魔龙兵符","战神兵符","火龙兵符","天龙兵符","神龙兵符","聖龍兵符","宗师兵符",}, 
	},
	[38] = {
 		["key_name"]=38,
		["type"]="生肖",
		["equip_list"]={"生肖(鼠)","生肖(牛)","生肖(虎)","生肖(兔)","生肖(龍)","生肖(蛇)","生肖(馬)","生肖(羊)","生肖(猴)","生肖(鸡)","生肖(狗)","生肖(猪)","上古·生肖(鼠)","上古·生肖(牛)","上古·生肖(虎)","上古·生肖(兔)","上古·生肖(龍)","上古·生肖(蛇)","上古·生肖(馬)","上古·生肖(羊)","上古·生肖(猴)","上古·生肖(鸡)","上古·生肖(狗)","上古·生肖(猪)","传承·生肖(鼠)","传承·生肖(牛)","传承·生肖(虎)","传承·生肖(兔)","传承·生肖(龍)","传承·生肖(蛇)","传承·生肖(馬)","传承·生肖(羊)","传承·生肖(猴)","传承·生肖(鸡)","传承·生肖(狗)","传承·生肖(猪)",}, 
	},
}
return config;