---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["level"]=40,
		["arr_map"]="30#5|35#500|13#10|14#10",
		["desc"]="<总强化等级40级，自动获得隐藏属性:/FCOLOR=251>\\<体力增加5%、功魔道伤5%、准确敏捷+10/FCOLOR=250>", 
	},
	[2] = {
 		["key_name"]=2,
		["level"]=50,
		["arr_map"]="30#6|35#600|13#20|14#20|15#1",
		["desc"]="<总强化等级50级，自动获得隐藏属性:/FCOLOR=251>\\<体力增加6%、功魔道伤6%、准确敏捷+20、魔法躲避10%/FCOLOR=250>", 
	},
	[3] = {
 		["key_name"]=3,
		["level"]=60,
		["arr_map"]="30#7|35#700|13#30|14#30|15#1",
		["desc"]="<总强化等级60级，自动获得隐藏属性:/FCOLOR=251>\\<体力增加7%、功魔道伤7%、准确敏捷+30、魔法躲避10%/FCOLOR=250>", 
	},
	[4] = {
 		["key_name"]=4,
		["level"]=70,
		["arr_map"]="30#8|35#800|13#40|14#40|15#2|67#500|34#500",
		["desc"]="<总强化等级70级，自动获得隐藏属性:/FCOLOR=251>\\<体力增加8%、攻魔道伤8%、准确敏捷+40、魔法躲避20%、攻击倍数5%、攻击吸血5%/FCOLOR=249>", 
	},
	[5] = {
 		["key_name"]=5,
		["level"]=80,
		["arr_map"]="30#9|35#900|13#50|14#50|15#2|67#1000|34#1000",
		["desc"]="<总强化等级80级，自动获得隐藏属性:/FCOLOR=251>\\<体力增加9%、攻魔道伤9%、准确敏捷+50、魔法躲避20%、攻击倍数10%、攻击吸血10%/FCOLOR=249>", 
	},  
}
 return config;