---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	["【风云】卧龙守将"] = {
 		["key_name"]=[[【风云】卧龙守将]],
		["color"]=249, 
	},
	["【青城】卧龙守将"] = {
 		["key_name"]=[[【青城】卧龙守将]],
		["color"]=249, 
	},
	["【新月】卧龙守将"] = {
 		["key_name"]=[[【新月】卧龙守将]],
		["color"]=249, 
	},
	["【御风】卧龙守将"] = {
 		["key_name"]=[[【御风】卧龙守将]],
		["color"]=249, 
	},
	["【斩浪】卧龙守将"] = {
 		["key_name"]=[[【斩浪】卧龙守将]],
		["color"]=249, 
	},
	["暗夜黄泉教主"] = {
 		["key_name"]=[[暗夜黄泉教主]],
		["color"]=249, 
	},
	["暗夜巨龙"] = {
 		["key_name"]=[[暗夜巨龙]],
		["color"]=249, 
	},
	["暗夜魔眼巨龙"] = {
 		["key_name"]=[[暗夜魔眼巨龙]],
		["color"]=249, 
	},
	["白虎·五行神兽"] = {
 		["key_name"]=[[白虎·五行神兽]],
		["color"]=249, 
	},
	["白野猪王"] = {
 		["key_name"]=[[白野猪王]],
		["color"]=249, 
	},
	["变异半兽统领"] = {
 		["key_name"]=[[变异半兽统领]],
		["color"]=249, 
	},
	["变异的死亡尸虫"] = {
 		["key_name"]=[[变异的死亡尸虫]],
		["color"]=249, 
	},
	["变异的死亡雪人"] = {
 		["key_name"]=[[变异的死亡雪人]],
		["color"]=249, 
	},
	["变异的死亡战将"] = {
 		["key_name"]=[[变异的死亡战将]],
		["color"]=249, 
	},
	["冰霜虫妖"] = {
 		["key_name"]=[[冰霜虫妖]],
		["color"]=249, 
	},
	["冰霜巨斧精"] = {
 		["key_name"]=[[冰霜巨斧精]],
		["color"]=249, 
	},
	["冰霜狼妖"] = {
 		["key_name"]=[[冰霜狼妖]],
		["color"]=249, 
	},
	["冰霜雪人精"] = {
 		["key_name"]=[[冰霜雪人精]],
		["color"]=249, 
	},
	["冰霜雪妖"] = {
 		["key_name"]=[[冰霜雪妖]],
		["color"]=249, 
	},
	["策划老白"] = {
 		["key_name"]=[[策划老白]],
		["color"]=249, 
	},
	["朝九晚九做牛马"] = {
 		["key_name"]=[[朝九晚九做牛马]],
		["color"]=249, 
	},
	["持戒尊者"] = {
 		["key_name"]=[[持戒尊者]],
		["color"]=249, 
	},
	["赤月老祖"] = {
 		["key_name"]=[[赤月老祖]],
		["color"]=249, 
	},
	["大魔王·洞窟狼王"] = {
 		["key_name"]=[[大魔王·洞窟狼王]],
		["color"]=249, 
	},
	["大魔王·古镇锤王"] = {
 		["key_name"]=[[大魔王·古镇锤王]],
		["color"]=249, 
	},
	["大魔王·鬼蜮战神"] = {
 		["key_name"]=[[大魔王·鬼蜮战神]],
		["color"]=249, 
	},
	["大魔王·幻境死神"] = {
 		["key_name"]=[[大魔王·幻境死神]],
		["color"]=249, 
	},
	["大魔王·祭坛战神"] = {
 		["key_name"]=[[大魔王·祭坛战神]],
		["color"]=249, 
	},
	["大魔王·魔岛剑灵"] = {
 		["key_name"]=[[大魔王·魔岛剑灵]],
		["color"]=249, 
	},
	["大魔王·山庄恶灵"] = {
 		["key_name"]=[[大魔王·山庄恶灵]],
		["color"]=249, 
	},
	["大魔王·神殿刀圣"] = {
 		["key_name"]=[[大魔王·神殿刀圣]],
		["color"]=249, 
	},
	["大魔王·神域天君"] = {
 		["key_name"]=[[大魔王·神域天君]],
		["color"]=249, 
	},
	["大魔王·石墓妖王"] = {
 		["key_name"]=[[大魔王·石墓妖王]],
		["color"]=249, 
	},
	["大魔王·峡谷寨主"] = {
 		["key_name"]=[[大魔王·峡谷寨主]],
		["color"]=249, 
	},
	["大魔王·仙境大将"] = {
 		["key_name"]=[[大魔王·仙境大将]],
		["color"]=249, 
	},
	["大魔王·遗迹妖妃"] = {
 		["key_name"]=[[大魔王·遗迹妖妃]],
		["color"]=249, 
	},
	["地狱雕像"] = {
 		["key_name"]=[[地狱雕像]],
		["color"]=249, 
	},
	["地狱恶魔·骷髅王[真身]"] = {
 		["key_name"]="地狱恶魔·骷髅王[真身]",
		["color"]=249, 
	},
	["地狱恶魔·舔狗王[真身]"] = {
 		["key_name"]="地狱恶魔·舔狗王[真身]",
		["color"]=249, 
	},
	["地狱恶魔·万奴王[真身]"] = {
 		["key_name"]="地狱恶魔·万奴王[真身]",
		["color"]=249, 
	},
	["地狱恶魔·雪人王[真身]"] = {
 		["key_name"]="地狱恶魔·雪人王[真身]",
		["color"]=249, 
	},
	["地狱恶魔·阎罗王[真身]"] = {
 		["key_name"]="地狱恶魔·阎罗王[真身]",
		["color"]=249, 
	},
	["地狱恶魔·夜叉王[真身]"] = {
 		["key_name"]="地狱恶魔·夜叉王[真身]",
		["color"]=249, 
	},
	["地狱骷髅王"] = {
 		["key_name"]=[[地狱骷髅王]],
		["color"]=249, 
	},
	["地狱魔神·厄运之主[真身]"] = {
 		["key_name"]="地狱魔神·厄运之主[真身]",
		["color"]=249, 
	},
	["地狱魔神·厄运之主[真身]1"] = {
 		["key_name"]="地狱魔神·厄运之主[真身]1",
		["color"]=249, 
	},
	["地狱魔神·诡异之主[真身]"] = {
 		["key_name"]="地狱魔神·诡异之主[真身]",
		["color"]=249, 
	},
	["地狱魔神·诡异之主[真身]1"] = {
 		["key_name"]="地狱魔神·诡异之主[真身]1",
		["color"]=249, 
	},
	["地狱魔神·禁忌之主[真身]"] = {
 		["key_name"]="地狱魔神·禁忌之主[真身]",
		["color"]=249, 
	},
	["地狱魔神·禁忌之主[真身]1"] = {
 		["key_name"]="地狱魔神·禁忌之主[真身]1",
		["color"]=249, 
	},
	["地狱魔神·神秘之主[真身]"] = {
 		["key_name"]="地狱魔神·神秘之主[真身]",
		["color"]=249, 
	},
	["地狱魔神·神秘之主[真身]1"] = {
 		["key_name"]="地狱魔神·神秘之主[真身]1",
		["color"]=249, 
	},
	["地狱魔神·怨恨之主[真身]"] = {
 		["key_name"]="地狱魔神·怨恨之主[真身]",
		["color"]=249, 
	},
	["地狱魔神·怨恨之主[真身]1"] = {
 		["key_name"]="地狱魔神·怨恨之主[真身]1",
		["color"]=249, 
	},
	["地狱魔神·罪恶之主[真身]"] = {
 		["key_name"]="地狱魔神·罪恶之主[真身]",
		["color"]=249, 
	},
	["地狱魔神·罪恶之主[真身]1"] = {
 		["key_name"]="地狱魔神·罪恶之主[真身]1",
		["color"]=249, 
	},
	["地狱天狼"] = {
 		["key_name"]=[[地狱天狼]],
		["color"]=249, 
	},
	["地狱卫士"] = {
 		["key_name"]=[[地狱卫士]],
		["color"]=249, 
	},
	["地狱月魔"] = {
 		["key_name"]=[[地狱月魔]],
		["color"]=249, 
	},
	["地狱蜘蛛王"] = {
 		["key_name"]=[[地狱蜘蛛王]],
		["color"]=249, 
	},
	["洞窟邪恶虫妖"] = {
 		["key_name"]=[[洞窟邪恶虫妖]],
		["color"]=249, 
	},
	["洞窟邪恶狼妖"] = {
 		["key_name"]=[[洞窟邪恶狼妖]],
		["color"]=249, 
	},
	["洞窟邪恶兽妖"] = {
 		["key_name"]=[[洞窟邪恶兽妖]],
		["color"]=249, 
	},
	["堕落饿死鬼"] = {
 		["key_name"]=[[堕落饿死鬼]],
		["color"]=249, 
	},
	["堕落累死鬼"] = {
 		["key_name"]=[[堕落累死鬼]],
		["color"]=249, 
	},
	["堕落摔死鬼"] = {
 		["key_name"]=[[堕落摔死鬼]],
		["color"]=249, 
	},
	["堕落淹死鬼"] = {
 		["key_name"]=[[堕落淹死鬼]],
		["color"]=249, 
	},
	["堕落冤死鬼"] = {
 		["key_name"]=[[堕落冤死鬼]],
		["color"]=249, 
	},
	["厄运·混沌祭祀"] = {
 		["key_name"]=[[厄运·混沌祭祀]],
		["color"]=249, 
	},
	["厄运的恶毒女巫"] = {
 		["key_name"]=[[厄运的恶毒女巫]],
		["color"]=249, 
	},
	["厄运的诡计女神"] = {
 		["key_name"]=[[厄运的诡计女神]],
		["color"]=249, 
	},
	["厄运的剧毒猛犸"] = {
 		["key_name"]=[[厄运的剧毒猛犸]],
		["color"]=249, 
	},
	["恶魔蜘蛛"] = {
 		["key_name"]=[[恶魔蜘蛛]],
		["color"]=249, 
	},
	["法老恶蛆"] = {
 		["key_name"]=[[法老恶蛆]],
		["color"]=249, 
	},
	["法老护卫"] = {
 		["key_name"]=[[法老护卫]],
		["color"]=249, 
	},
	["法老祭祀"] = {
 		["key_name"]=[[法老祭祀]],
		["color"]=249, 
	},
	["法老蜈蚣"] = {
 		["key_name"]=[[法老蜈蚣]],
		["color"]=249, 
	},
	["风餐露宿流浪鬼"] = {
 		["key_name"]=[[风餐露宿流浪鬼]],
		["color"]=249, 
	},
	["封印异兽"] = {
 		["key_name"]=[[封印异兽]],
		["color"]=249, 
	},
	["腐经诵者"] = {
 		["key_name"]=[[腐经诵者]],
		["color"]=249, 
	},
	["古镇剑魔"] = {
 		["key_name"]=[[古镇剑魔]],
		["color"]=249, 
	},
	["古镇蛇妖"] = {
 		["key_name"]=[[古镇蛇妖]],
		["color"]=249, 
	},
	["古镇神捕"] = {
 		["key_name"]=[[古镇神捕]],
		["color"]=249, 
	},
	["骨灯侍从"] = {
 		["key_name"]=[[骨灯侍从]],
		["color"]=249, 
	},
	["诡异·地牢教主"] = {
 		["key_name"]=[[诡异·地牢教主]],
		["color"]=249, 
	},
	["诡异的火焰石狮"] = {
 		["key_name"]=[[诡异的火焰石狮]],
		["color"]=249, 
	},
	["诡异的远古幽灵"] = {
 		["key_name"]=[[诡异的远古幽灵]],
		["color"]=249, 
	},
	["诡异的诅咒石狮"] = {
 		["key_name"]=[[诡异的诅咒石狮]],
		["color"]=249, 
	},
	["鬼·噬魂大魔王"] = {
 		["key_name"]=[[鬼·噬魂大魔王]],
		["color"]=249, 
	},
	["鬼·噬魂判官"] = {
 		["key_name"]=[[鬼·噬魂判官]],
		["color"]=249, 
	},
	["鬼·噬魂尸王"] = {
 		["key_name"]=[[鬼·噬魂尸王]],
		["color"]=249, 
	},
	["鬼·噬魂无常"] = {
 		["key_name"]=[[鬼·噬魂无常]],
		["color"]=249, 
	},
	["鬼·噬魂阎罗"] = {
 		["key_name"]=[[鬼·噬魂阎罗]],
		["color"]=249, 
	},
	["鬼泣剧毒蟾虫"] = {
 		["key_name"]=[[鬼泣剧毒蟾虫]],
		["color"]=249, 
	},
	["鬼泣石狮"] = {
 		["key_name"]=[[鬼泣石狮]],
		["color"]=249, 
	},
	["鬼泣铁扇法师"] = {
 		["key_name"]=[[鬼泣铁扇法师]],
		["color"]=249, 
	},
	["鬼泣屠夫"] = {
 		["key_name"]=[[鬼泣屠夫]],
		["color"]=249, 
	},
	["鬼王"] = {
 		["key_name"]=[[鬼王]],
		["color"]=249, 
	},
	["鬼蜮冰魄"] = {
 		["key_name"]=[[鬼蜮冰魄]],
		["color"]=249, 
	},
	["鬼蜮禁婆"] = {
 		["key_name"]=[[鬼蜮禁婆]],
		["color"]=249, 
	},
	["鬼蜮炎魔"] = {
 		["key_name"]=[[鬼蜮炎魔]],
		["color"]=249, 
	},
	["贵族·材料之王"] = {
 		["key_name"]=[[贵族·材料之王]],
		["color"]=249, 
	},
	["贵族·财富之王"] = {
 		["key_name"]=[[贵族·财富之王]],
		["color"]=249, 
	},
	["贵族·经验之王"] = {
 		["key_name"]=[[贵族·经验之王]],
		["color"]=249, 
	},
	["贵族·秘宝之王"] = {
 		["key_name"]=[[贵族·秘宝之王]],
		["color"]=249, 
	},
	["亥时二刻冤死鬼"] = {
 		["key_name"]=[[亥时二刻冤死鬼]],
		["color"]=249, 
	},
	["寒冰变异雪妖"] = {
 		["key_name"]=[[寒冰变异雪妖]],
		["color"]=249, 
	},
	["寒冰钢牙蜘蛛"] = {
 		["key_name"]=[[寒冰钢牙蜘蛛]],
		["color"]=249, 
	},
	["寒冰长矛猎人"] = {
 		["key_name"]=[[寒冰长矛猎人]],
		["color"]=249, 
	},
	["寒髓矿奴"] = {
 		["key_name"]=[[寒髓矿奴]],
		["color"]=249, 
	},
	["黑暗异兽"] = {
 		["key_name"]=[[黑暗异兽]],
		["color"]=249, 
	},
	["黑牙蜘蛛"] = {
 		["key_name"]=[[黑牙蜘蛛]],
		["color"]=249, 
	},
	["虹魔蝎卫"] = {
 		["key_name"]=[[虹魔蝎卫]],
		["color"]=249, 
	},
	["虹魔猪卫"] = {
 		["key_name"]=[[虹魔猪卫]],
		["color"]=249, 
	},
	["护法天"] = {
 		["key_name"]=[[护法天]],
		["color"]=249, 
	},
	["幻境白胡子"] = {
 		["key_name"]=[[幻境白胡子]],
		["color"]=249, 
	},
	["幻境稻草人"] = {
 		["key_name"]=[[幻境稻草人]],
		["color"]=249, 
	},
	["幻境巫术师"] = {
 		["key_name"]=[[幻境巫术师]],
		["color"]=249, 
	},
	["幻灵钳虫"] = {
 		["key_name"]=[[幻灵钳虫]],
		["color"]=249, 
	},
	["幻灵兽王"] = {
 		["key_name"]=[[幻灵兽王]],
		["color"]=249, 
	},
	["幻灵卫士"] = {
 		["key_name"]=[[幻灵卫士]],
		["color"]=249, 
	},
	["幻灵蝎蛇"] = {
 		["key_name"]=[[幻灵蝎蛇]],
		["color"]=249, 
	},
	["幻形妖王"] = {
 		["key_name"]=[[幻形妖王]],
		["color"]=249, 
	},
	["黄金泰坦巨人"] = {
 		["key_name"]=[[黄金泰坦巨人]],
		["color"]=249, 
	},
	["火龙刀兵"] = {
 		["key_name"]=[[火龙刀兵]],
		["color"]=249, 
	},
	["火龙巨蛾"] = {
 		["key_name"]=[[火龙巨蛾]],
		["color"]=249, 
	},
	["火龙力士"] = {
 		["key_name"]=[[火龙力士]],
		["color"]=249, 
	},
	["火龙魔锤"] = {
 		["key_name"]=[[火龙魔锤]],
		["color"]=249, 
	},
	["火龙射手"] = {
 		["key_name"]=[[火龙射手]],
		["color"]=249, 
	},
	["火龙卫士"] = {
 		["key_name"]=[[火龙卫士]],
		["color"]=249, 
	},
	["火龙蜥蜴"] = {
 		["key_name"]=[[火龙蜥蜴]],
		["color"]=249, 
	},
	["火龙战将"] = {
 		["key_name"]=[[火龙战将]],
		["color"]=249, 
	},
	["记忆窃贼"] = {
 		["key_name"]=[[记忆窃贼]],
		["color"]=249, 
	},
	["祭坛亡灵护卫"] = {
 		["key_name"]=[[祭坛亡灵护卫]],
		["color"]=249, 
	},
	["祭坛亡灵将军"] = {
 		["key_name"]=[[祭坛亡灵将军]],
		["color"]=249, 
	},
	["祭坛亡灵守卫"] = {
 		["key_name"]=[[祭坛亡灵守卫]],
		["color"]=249, 
	},
	["蛟魔王"] = {
 		["key_name"]=[[蛟魔王]],
		["color"]=249, 
	},
	["金杖蜘蛛"] = {
 		["key_name"]=[[金杖蜘蛛]],
		["color"]=249, 
	},
	["禁忌·鲲鹏巨兽"] = {
 		["key_name"]=[[禁忌·鲲鹏巨兽]],
		["color"]=249, 
	},
	["禁忌的寒冰雕像"] = {
 		["key_name"]=[[禁忌的寒冰雕像]],
		["color"]=249, 
	},
	["禁忌的骷髅精灵"] = {
 		["key_name"]=[[禁忌的骷髅精灵]],
		["color"]=249, 
	},
	["禁忌的月魔蜘蛛"] = {
 		["key_name"]=[[禁忌的月魔蜘蛛]],
		["color"]=249, 
	},
	["禁婆"] = {
 		["key_name"]=[[禁婆]],
		["color"]=249, 
	},
	["巨镰蜘蛛"] = {
 		["key_name"]=[[巨镰蜘蛛]],
		["color"]=249, 
	},
	["巨魔·洞窟炎魔"] = {
 		["key_name"]=[[巨魔·洞窟炎魔]],
		["color"]=249, 
	},
	["巨魔·古镇法王"] = {
 		["key_name"]=[[巨魔·古镇法王]],
		["color"]=249, 
	},
	["巨魔·鬼蜮骑士"] = {
 		["key_name"]=[[巨魔·鬼蜮骑士]],
		["color"]=249, 
	},
	["巨魔·幻境魔王"] = {
 		["key_name"]=[[巨魔·幻境魔王]],
		["color"]=249, 
	},
	["巨魔·祭坛神将"] = {
 		["key_name"]=[[巨魔·祭坛神将]],
		["color"]=249, 
	},
	["巨魔·魔岛祭祀"] = {
 		["key_name"]=[[巨魔·魔岛祭祀]],
		["color"]=249, 
	},
	["巨魔·山庄头目"] = {
 		["key_name"]=[[巨魔·山庄头目]],
		["color"]=249, 
	},
	["巨魔·神殿刀魔"] = {
 		["key_name"]=[[巨魔·神殿刀魔]],
		["color"]=249, 
	},
	["巨魔·神域武尊"] = {
 		["key_name"]=[[巨魔·神域武尊]],
		["color"]=249, 
	},
	["巨魔·石墓夜王"] = {
 		["key_name"]=[[巨魔·石墓夜王]],
		["color"]=249, 
	},
	["巨魔·峡谷先锋"] = {
 		["key_name"]=[[巨魔·峡谷先锋]],
		["color"]=249, 
	},
	["巨魔·仙境真君"] = {
 		["key_name"]=[[巨魔·仙境真君]],
		["color"]=249, 
	},
	["巨魔·遗迹牛魔"] = {
 		["key_name"]=[[巨魔·遗迹牛魔]],
		["color"]=249, 
	},
	["巨兽·地狱寒冰魔"] = {
 		["key_name"]=[[巨兽·地狱寒冰魔]],
		["color"]=249, 
	},
	["巨兽·地狱灭天魔"] = {
 		["key_name"]=[[巨兽·地狱灭天魔]],
		["color"]=249, 
	},
	["巨兽·地狱五毒魔"] = {
 		["key_name"]=[[巨兽·地狱五毒魔]],
		["color"]=249, 
	},
	["巨兽·堕落魔盒"] = {
 		["key_name"]=[[巨兽·堕落魔盒]],
		["color"]=249, 
	},
	["巨兽·寒冰巨魔"] = {
 		["key_name"]=[[巨兽·寒冰巨魔]],
		["color"]=249, 
	},
	["巨兽·虹魔教主"] = {
 		["key_name"]=[[巨兽·虹魔教主]],
		["color"]=249, 
	},
	["巨兽·幻灵猎手"] = {
 		["key_name"]=[[巨兽·幻灵猎手]],
		["color"]=249, 
	},
	["巨兽·皇陵守将"] = {
 		["key_name"]=[[巨兽·皇陵守将]],
		["color"]=249, 
	},
	["巨兽·祭坛守将"] = {
 		["key_name"]=[[巨兽·祭坛守将]],
		["color"]=249, 
	},
	["巨兽·巨斧战将"] = {
 		["key_name"]=[[巨兽·巨斧战将]],
		["color"]=249, 
	},
	["巨兽·骷髅教主"] = {
 		["key_name"]=[[巨兽·骷髅教主]],
		["color"]=249, 
	},
	["巨兽·琅琊金龙"] = {
 		["key_name"]=[[巨兽·琅琊金龙]],
		["color"]=249, 
	},
	["巨兽·利刃守将"] = {
 		["key_name"]=[[巨兽·利刃守将]],
		["color"]=249, 
	},
	["巨兽·炼狱鬼将"] = {
 		["key_name"]=[[巨兽·炼狱鬼将]],
		["color"]=249, 
	},
	["巨兽·灵魂收割者"] = {
 		["key_name"]=[[巨兽·灵魂收割者]],
		["color"]=249, 
	},
	["巨兽·魔龙教主"] = {
 		["key_name"]=[[巨兽·魔龙教主]],
		["color"]=249, 
	},
	["巨兽·牛魔王"] = {
 		["key_name"]=[[巨兽·牛魔王]],
		["color"]=249, 
	},
	["巨兽·起源屠夫"] = {
 		["key_name"]=[[巨兽·起源屠夫]],
		["color"]=249, 
	},
	["巨兽·神庙罗汉"] = {
 		["key_name"]=[[巨兽·神庙罗汉]],
		["color"]=249, 
	},
	["巨兽·神域剑魔"] = {
 		["key_name"]=[[巨兽·神域剑魔]],
		["color"]=249, 
	},
	["巨兽·石墓猪王"] = {
 		["key_name"]=[[巨兽·石墓猪王]],
		["color"]=249, 
	},
	["巨兽·万年守将"] = {
 		["key_name"]=[[巨兽·万年守将]],
		["color"]=249, 
	},
	["巨兽·遗忘孤魂"] = {
 		["key_name"]=[[巨兽·遗忘孤魂]],
		["color"]=249, 
	},
	["巨兽·阴阳法王"] = {
 		["key_name"]=[[巨兽·阴阳法王]],
		["color"]=249, 
	},
	["巨兽·震天守将"] = {
 		["key_name"]=[[巨兽·震天守将]],
		["color"]=249, 
	},
	["巨兽·祖玛教主"] = {
 		["key_name"]=[[巨兽·祖玛教主]],
		["color"]=249, 
	},
	["恐惧的恶魔法王"] = {
 		["key_name"]=[[恐惧的恶魔法王]],
		["color"]=249, 
	},
	["恐惧的双刀鬼王"] = {
 		["key_name"]=[[恐惧的双刀鬼王]],
		["color"]=249, 
	},
	["恐惧的索命鬼王"] = {
 		["key_name"]=[[恐惧的索命鬼王]],
		["color"]=249, 
	},
	["骷髅王"] = {
 		["key_name"]=[[骷髅王]],
		["color"]=249, 
	},
	["蓝背蜘蛛"] = {
 		["key_name"]=[[蓝背蜘蛛]],
		["color"]=249, 
	},
	["琅琊黑牙蜘蛛"] = {
 		["key_name"]=[[琅琊黑牙蜘蛛]],
		["color"]=249, 
	},
	["琅琊蓝背蜘蛛"] = {
 		["key_name"]=[[琅琊蓝背蜘蛛]],
		["color"]=249, 
	},
	["琅琊绿魔蜘蛛"] = {
 		["key_name"]=[[琅琊绿魔蜘蛛]],
		["color"]=249, 
	},
	["琅琊铁翼巨蛾"] = {
 		["key_name"]=[[琅琊铁翼巨蛾]],
		["color"]=249, 
	},
	["老登长老"] = {
 		["key_name"]=[[老登长老]],
		["color"]=249, 
	},
	["炼狱法师"] = {
 		["key_name"]=[[炼狱法师]],
		["color"]=249, 
	},
	["炼狱鬼将"] = {
 		["key_name"]=[[炼狱鬼将]],
		["color"]=249, 
	},
	["炼狱侍卫"] = {
 		["key_name"]=[[炼狱侍卫]],
		["color"]=249, 
	},
	["炼狱战士"] = {
 		["key_name"]=[[炼狱战士]],
		["color"]=249, 
	},
	["裂颚鬣狗"] = {
 		["key_name"]=[[裂颚鬣狗]],
		["color"]=249, 
	},
	["龙蛋"] = {
 		["key_name"]=[[龙蛋]],
		["color"]=249, 
	},
	["罗刹王·暗夜修罗"] = {
 		["key_name"]=[[罗刹王·暗夜修罗]],
		["color"]=249, 
	},
	["罗刹王·地府判官"] = {
 		["key_name"]=[[罗刹王·地府判官]],
		["color"]=249, 
	},
	["罗刹王·九世妖姬"] = {
 		["key_name"]=[[罗刹王·九世妖姬]],
		["color"]=249, 
	},
	["罗刹王·骷髅鬼将"] = {
 		["key_name"]=[[罗刹王·骷髅鬼将]],
		["color"]=249, 
	},
	["罗刹王·青眼狐尸"] = {
 		["key_name"]=[[罗刹王·青眼狐尸]],
		["color"]=249, 
	},
	["罗刹王·血饮狂刀"] = {
 		["key_name"]=[[罗刹王·血饮狂刀]],
		["color"]=249, 
	},
	["绿魔蜘蛛"] = {
 		["key_name"]=[[绿魔蜘蛛]],
		["color"]=249, 
	},
	["马面"] = {
 		["key_name"]=[[马面]],
		["color"]=249, 
	},
	["玛雅金刚"] = {
 		["key_name"]=[[玛雅金刚]],
		["color"]=249, 
	},
	["玛雅血魔"] = {
 		["key_name"]=[[玛雅血魔]],
		["color"]=249, 
	},
	["卯时一刻吊死鬼"] = {
 		["key_name"]=[[卯时一刻吊死鬼]],
		["color"]=249, 
	},
	["迷失独臂猎手"] = {
 		["key_name"]=[[迷失独臂猎手]],
		["color"]=249, 
	},
	["迷失嗜血巨象"] = {
 		["key_name"]=[[迷失嗜血巨象]],
		["color"]=249, 
	},
	["迷失双刀屠夫"] = {
 		["key_name"]=[[迷失双刀屠夫]],
		["color"]=249, 
	},
	["魔·幽灵冰魔"] = {
 		["key_name"]=[[魔·幽灵冰魔]],
		["color"]=249, 
	},
	["魔·幽灵大魔王"] = {
 		["key_name"]=[[魔·幽灵大魔王]],
		["color"]=249, 
	},
	["魔·幽灵鬼锤"] = {
 		["key_name"]=[[魔·幽灵鬼锤]],
		["color"]=249, 
	},
	["魔·幽灵鬼手"] = {
 		["key_name"]=[[魔·幽灵鬼手]],
		["color"]=249, 
	},
	["魔·幽灵鬼眼"] = {
 		["key_name"]=[[魔·幽灵鬼眼]],
		["color"]=249, 
	},
	["魔·幽灵炎魔"] = {
 		["key_name"]=[[魔·幽灵炎魔]],
		["color"]=249, 
	},
	["魔岛刀侍"] = {
 		["key_name"]=[[魔岛刀侍]],
		["color"]=249, 
	},
	["魔岛剑侍"] = {
 		["key_name"]=[[魔岛剑侍]],
		["color"]=249, 
	},
	["魔岛琴师"] = {
 		["key_name"]=[[魔岛琴师]],
		["color"]=249, 
	},
	["魔界暗龙"] = {
 		["key_name"]=[[魔界暗龙]],
		["color"]=249, 
	},
	["魔界苍龙"] = {
 		["key_name"]=[[魔界苍龙]],
		["color"]=249, 
	},
	["魔界恶龙"] = {
 		["key_name"]=[[魔界恶龙]],
		["color"]=249, 
	},
	["魔界飞龙"] = {
 		["key_name"]=[[魔界飞龙]],
		["color"]=249, 
	},
	["魔界神龙"] = {
 		["key_name"]=[[魔界神龙]],
		["color"]=249, 
	},
	["魔界天龙"] = {
 		["key_name"]=[[魔界天龙]],
		["color"]=249, 
	},
	["魔界邪龙"] = {
 		["key_name"]=[[魔界邪龙]],
		["color"]=249, 
	},
	["魔界炎龙"] = {
 		["key_name"]=[[魔界炎龙]],
		["color"]=249, 
	},
	["魔龙巨蛾"] = {
 		["key_name"]=[[魔龙巨蛾]],
		["color"]=249, 
	},
	["魔龙力士"] = {
 		["key_name"]=[[魔龙力士]],
		["color"]=249, 
	},
	["魔龙战将"] = {
 		["key_name"]=[[魔龙战将]],
		["color"]=249, 
	},
	["魔童哪吒(狂暴之体)"] = {
 		["key_name"]=[[魔童哪吒(狂暴之体)]],
		["color"]=249, 
	},
	["魔童哪吒(魔化之体)"] = {
 		["key_name"]=[[魔童哪吒(魔化之体)]],
		["color"]=249, 
	},
	["魔童哪吒(元神之体)"] = {
 		["key_name"]=[[魔童哪吒(元神之体)]],
		["color"]=249, 
	},
	["魔童哪吒(真身之体)"] = {
 		["key_name"]=[[魔童哪吒(真身之体)]],
		["color"]=249, 
	},
	["魔王·暗影神将"] = {
 		["key_name"]=[[魔王·暗影神将]],
		["color"]=249, 
	},
	["魔王·地藏魔王"] = {
 		["key_name"]=[[魔王·地藏魔王]],
		["color"]=249, 
	},
	["魔王·地狱哮天犬"] = {
 		["key_name"]=[[魔王·地狱哮天犬]],
		["color"]=249, 
	},
	["魔王·堕落天使"] = {
 		["key_name"]=[[魔王·堕落天使]],
		["color"]=249, 
	},
	["魔王·寒冰幽影"] = {
 		["key_name"]=[[魔王·寒冰幽影]],
		["color"]=249, 
	},
	["魔王·幻灵达摩"] = {
 		["key_name"]=[[魔王·幻灵达摩]],
		["color"]=249, 
	},
	["魔王·毁灭神将"] = {
 		["key_name"]=[[魔王·毁灭神将]],
		["color"]=249, 
	},
	["魔王·火龙教主"] = {
 		["key_name"]=[[魔王·火龙教主]],
		["color"]=249, 
	},
	["魔王·惊悚神将"] = {
 		["key_name"]=[[魔王·惊悚神将]],
		["color"]=249, 
	},
	["魔王·绝望神将"] = {
 		["key_name"]=[[魔王·绝望神将]],
		["color"]=249, 
	},
	["魔王·琅琊剑魔"] = {
 		["key_name"]=[[魔王·琅琊剑魔]],
		["color"]=249, 
	},
	["魔王·雷炎蛛王"] = {
 		["key_name"]=[[魔王·雷炎蛛王]],
		["color"]=249, 
	},
	["魔王·炼狱判官"] = {
 		["key_name"]=[[魔王·炼狱判官]],
		["color"]=249, 
	},
	["魔王·玛雅恶魔"] = {
 		["key_name"]=[[魔王·玛雅恶魔]],
		["color"]=249, 
	},
	["魔王·玛雅树妖"] = {
 		["key_name"]=[[魔王·玛雅树妖]],
		["color"]=249, 
	},
	["魔王·玛雅影魔"] = {
 		["key_name"]=[[魔王·玛雅影魔]],
		["color"]=249, 
	},
	["魔王·魔影巨人"] = {
 		["key_name"]=[[魔王·魔影巨人]],
		["color"]=249, 
	},
	["魔王·起源冰魔"] = {
 		["key_name"]=[[魔王·起源冰魔]],
		["color"]=249, 
	},
	["魔王·神庙梦魇"] = {
 		["key_name"]=[[魔王·神庙梦魇]],
		["color"]=249, 
	},
	["魔王·神域罗汉"] = {
 		["key_name"]=[[魔王·神域罗汉]],
		["color"]=249, 
	},
	["魔王·痛苦神将"] = {
 		["key_name"]=[[魔王·痛苦神将]],
		["color"]=249, 
	},
	["魔王·遗忘无常"] = {
 		["key_name"]=[[魔王·遗忘无常]],
		["color"]=249, 
	},
	["魔王·幽灵神将"] = {
 		["key_name"]=[[魔王·幽灵神将]],
		["color"]=249, 
	},
	["魔王·诅咒神将"] = {
 		["key_name"]=[[魔王·诅咒神将]],
		["color"]=249, 
	},
	["魔月血神"] = {
 		["key_name"]=[[魔月血神]],
		["color"]=249, 
	},
	["末日地牢守卫"] = {
 		["key_name"]=[[末日地牢守卫]],
		["color"]=249, 
	},
	["末日仙人掌"] = {
 		["key_name"]=[[末日仙人掌]],
		["color"]=249, 
	},
	["末日幽灵守卫"] = {
 		["key_name"]=[[末日幽灵守卫]],
		["color"]=249, 
	},
	["末日章鱼怪"] = {
 		["key_name"]=[[末日章鱼怪]],
		["color"]=249, 
	},
	["溺亡水手"] = {
 		["key_name"]=[[溺亡水手]],
		["color"]=249, 
	},
	["牛魔将军"] = {
 		["key_name"]=[[牛魔将军]],
		["color"]=249, 
	},
	["牛头"] = {
 		["key_name"]=[[牛头]],
		["color"]=249, 
	},
	["麒麟·五行神兽"] = {
 		["key_name"]=[[麒麟·五行神兽]],
		["color"]=249, 
	},
	["起源地牢罗汉"] = {
 		["key_name"]=[[起源地牢罗汉]],
		["color"]=249, 
	},
	["起源地牢石狮"] = {
 		["key_name"]=[[起源地牢石狮]],
		["color"]=249, 
	},
	["起源地牢亡灵"] = {
 		["key_name"]=[[起源地牢亡灵]],
		["color"]=249, 
	},
	["起源地牢幽灵"] = {
 		["key_name"]=[[起源地牢幽灵]],
		["color"]=249, 
	},
	["千年树妖"] = {
 		["key_name"]=[[千年树妖]],
		["color"]=249, 
	},
	["青龙·五行神兽"] = {
 		["key_name"]=[[青龙·五行神兽]],
		["color"]=249, 
	},
	["撒旦·变异骷髅"] = {
 		["key_name"]=[[撒旦·变异骷髅]],
		["color"]=249, 
	},
	["撒旦·冰封野人"] = {
 		["key_name"]=[[撒旦·冰封野人]],
		["color"]=249, 
	},
	["撒旦·恶魔将军"] = {
 		["key_name"]=[[撒旦·恶魔将军]],
		["color"]=249, 
	},
	["撒旦·黑无常"] = {
 		["key_name"]=[[撒旦·黑无常]],
		["color"]=249, 
	},
	["撒旦·形单影只"] = {
 		["key_name"]=[[撒旦·形单影只]],
		["color"]=249, 
	},
	["撒旦·烛九阴"] = {
 		["key_name"]=[[撒旦·烛九阴]],
		["color"]=249, 
	},
	["撒旦魔王1"] = {
 		["key_name"]=[[撒旦魔王1]],
		["color"]=249, 
	},
	["三生三世单身狗"] = {
 		["key_name"]=[[三生三世单身狗]],
		["color"]=249, 
	},
	["山庄刺客"] = {
 		["key_name"]=[[山庄刺客]],
		["color"]=249, 
	},
	["山庄盗贼"] = {
 		["key_name"]=[[山庄盗贼]],
		["color"]=249, 
	},
	["山庄力士"] = {
 		["key_name"]=[[山庄力士]],
		["color"]=249, 
	},
	["熵变蠕虫"] = {
 		["key_name"]=[[熵变蠕虫]],
		["color"]=249, 
	},
	["神殿孤魂"] = {
 		["key_name"]=[[神殿孤魂]],
		["color"]=249, 
	},
	["神殿猎人"] = {
 		["key_name"]=[[神殿猎人]],
		["color"]=249, 
	},
	["神殿朱雀"] = {
 		["key_name"]=[[神殿朱雀]],
		["color"]=249, 
	},
	["神秘·巨镰金刚"] = {
 		["key_name"]=[[神秘·巨镰金刚]],
		["color"]=249, 
	},
	["神秘的黑旋风"] = {
 		["key_name"]=[[神秘的黑旋风]],
		["color"]=249, 
	},
	["神秘的锯齿蜂"] = {
 		["key_name"]=[[神秘的锯齿蜂]],
		["color"]=249, 
	},
	["神秘的史莱姆"] = {
 		["key_name"]=[[神秘的史莱姆]],
		["color"]=249, 
	},
	["神域斗士"] = {
 		["key_name"]=[[神域斗士]],
		["color"]=249, 
	},
	["神域斧卫"] = {
 		["key_name"]=[[神域斧卫]],
		["color"]=249, 
	},
	["神域祭祀"] = {
 		["key_name"]=[[神域祭祀]],
		["color"]=249, 
	},
	["神域剑客"] = {
 		["key_name"]=[[神域剑客]],
		["color"]=249, 
	},
	["神域枪兵"] = {
 		["key_name"]=[[神域枪兵]],
		["color"]=249, 
	},
	["神域射手"] = {
 		["key_name"]=[[神域射手]],
		["color"]=249, 
	},
	["神域守卫"] = {
 		["key_name"]=[[神域守卫]],
		["color"]=249, 
	},
	["圣殿卫士"] = {
 		["key_name"]=[[圣殿卫士]],
		["color"]=249, 
	},
	["聖龍·赤月恶魔"] = {
 		["key_name"]=[[聖龍·赤月恶魔]],
		["color"]=249, 
	},
	["聖龍·大圣"] = {
 		["key_name"]=[[聖龍·大圣]],
		["color"]=249, 
	},
	["聖龍·牛气冲天"] = {
 		["key_name"]=[[聖龍·牛气冲天]],
		["color"]=249, 
	},
	["石化魔眼"] = {
 		["key_name"]=[[石化魔眼]],
		["color"]=249, 
	},
	["石墓护国守将"] = {
 		["key_name"]=[[石墓护国守将]],
		["color"]=249, 
	},
	["石墓护国守卫"] = {
 		["key_name"]=[[石墓护国守卫]],
		["color"]=249, 
	},
	["石墓护国卫士"] = {
 		["key_name"]=[[石墓护国卫士]],
		["color"]=249, 
	},
	["时之仆从"] = {
 		["key_name"]=[[时之仆从]],
		["color"]=249, 
	},
	["噬光夜枭"] = {
 		["key_name"]=[[噬光夜枭]],
		["color"]=249, 
	},
	["霜魄游魂"] = {
 		["key_name"]=[[霜魄游魂]],
		["color"]=249, 
	},
	["死神之镰"] = {
 		["key_name"]=[[死神之镰]],
		["color"]=249, 
	},
	["碎骨蛮人"] = {
 		["key_name"]=[[碎骨蛮人]],
		["color"]=249, 
	},
	["泰坦·暗夜霸主"] = {
 		["key_name"]=[[泰坦·暗夜霸主]],
		["color"]=249, 
	},
	["泰坦·冰霜霸主"] = {
 		["key_name"]=[[泰坦·冰霜霸主]],
		["color"]=249, 
	},
	["泰坦·地狱霸主"] = {
 		["key_name"]=[[泰坦·地狱霸主]],
		["color"]=249, 
	},
	["泰坦·堕落巨魔"] = {
 		["key_name"]=[[泰坦·堕落巨魔]],
		["color"]=249, 
	},
	["泰坦·法老霸主"] = {
 		["key_name"]=[[泰坦·法老霸主]],
		["color"]=249, 
	},
	["泰坦·鬼泣霸主"] = {
 		["key_name"]=[[泰坦·鬼泣霸主]],
		["color"]=249, 
	},
	["泰坦·火龙神"] = {
 		["key_name"]=[[泰坦·火龙神]],
		["color"]=249, 
	},
	["泰坦·禁锢巨魔"] = {
 		["key_name"]=[[泰坦·禁锢巨魔]],
		["color"]=249, 
	},
	["泰坦·琅琊巨魔"] = {
 		["key_name"]=[[泰坦·琅琊巨魔]],
		["color"]=249, 
	},
	["泰坦·炼狱巨魔"] = {
 		["key_name"]=[[泰坦·炼狱巨魔]],
		["color"]=249, 
	},
	["泰坦·迷失霸主"] = {
 		["key_name"]=[[泰坦·迷失霸主]],
		["color"]=249, 
	},
	["泰坦·末日霸主"] = {
 		["key_name"]=[[泰坦·末日霸主]],
		["color"]=249, 
	},
	["泰坦·起源巨魔"] = {
 		["key_name"]=[[泰坦·起源巨魔]],
		["color"]=249, 
	},
	["泰坦·神域巨魔"] = {
 		["key_name"]=[[泰坦·神域巨魔]],
		["color"]=249, 
	},
	["泰坦·死神巨魔"] = {
 		["key_name"]=[[泰坦·死神巨魔]],
		["color"]=249, 
	},
	["泰坦·亡灵霸主"] = {
 		["key_name"]=[[泰坦·亡灵霸主]],
		["color"]=249, 
	},
	["泰坦·巫妖霸主"] = {
 		["key_name"]=[[泰坦·巫妖霸主]],
		["color"]=249, 
	},
	["泰坦·遗忘巨魔"] = {
 		["key_name"]=[[泰坦·遗忘巨魔]],
		["color"]=249, 
	},
	["泰坦·远古霸主"] = {
 		["key_name"]=[[泰坦·远古霸主]],
		["color"]=249, 
	},
	["泰坦恶魔·洞窟夜魔"] = {
 		["key_name"]=[[泰坦恶魔·洞窟夜魔]],
		["color"]=249, 
	},
	["泰坦恶魔·幻境夜神"] = {
 		["key_name"]=[[泰坦恶魔·幻境夜神]],
		["color"]=249, 
	},
	["泰坦恶魔·祭坛魔皇"] = {
 		["key_name"]=[[泰坦恶魔·祭坛魔皇]],
		["color"]=249, 
	},
	["泰坦恶魔·遗迹圣君"] = {
 		["key_name"]=[[泰坦恶魔·遗迹圣君]],
		["color"]=249, 
	},
	["泰坦魔神·古镇魔君"] = {
 		["key_name"]=[[泰坦魔神·古镇魔君]],
		["color"]=249, 
	},
	["泰坦魔神·鬼蜮神君"] = {
 		["key_name"]=[[泰坦魔神·鬼蜮神君]],
		["color"]=249, 
	},
	["泰坦魔神·魔岛女皇"] = {
 		["key_name"]=[[泰坦魔神·魔岛女皇]],
		["color"]=249, 
	},
	["泰坦魔神·山庄魔君"] = {
 		["key_name"]=[[泰坦魔神·山庄魔君]],
		["color"]=249, 
	},
	["泰坦魔神·神殿修罗"] = {
 		["key_name"]=[[泰坦魔神·神殿修罗]],
		["color"]=249, 
	},
	["泰坦魔神·神域圣佛"] = {
 		["key_name"]=[[泰坦魔神·神域圣佛]],
		["color"]=249, 
	},
	["泰坦魔神·石墓君主"] = {
 		["key_name"]=[[泰坦魔神·石墓君主]],
		["color"]=249, 
	},
	["泰坦魔神·峡谷天王"] = {
 		["key_name"]=[[泰坦魔神·峡谷天王]],
		["color"]=249, 
	},
	["泰坦魔神·仙境天王"] = {
 		["key_name"]=[[泰坦魔神·仙境天王]],
		["color"]=249, 
	},
	["天蓬将军"] = {
 		["key_name"]=[[天蓬将军]],
		["color"]=249, 
	},
	["铁翼巨蛾"] = {
 		["key_name"]=[[铁翼巨蛾]],
		["color"]=249, 
	},
	["万奴王[不惑]"] = {
 		["key_name"]="万奴王[不惑]",
		["color"]=249, 
	},
	["万奴王[不朽]"] = {
 		["key_name"]="万奴王[不朽]",
		["color"]=249, 
	},
	["万奴王[初识]"] = {
 		["key_name"]="万奴王[初识]",
		["color"]=249, 
	},
	["万奴王[洞玄]"] = {
 		["key_name"]="万奴王[洞玄]",
		["color"]=249, 
	},
	["万奴王[感知]"] = {
 		["key_name"]="万奴王[感知]",
		["color"]=249, 
	},
	["万奴王[涅槃]"] = {
 		["key_name"]="万奴王[涅槃]",
		["color"]=249, 
	},
	["万奴王[天启]"] = {
 		["key_name"]="万奴王[天启]",
		["color"]=249, 
	},
	["万奴王[无距]"] = {
 		["key_name"]="万奴王[无距]",
		["color"]=249, 
	},
	["万奴王[知命]"] = {
 		["key_name"]="万奴王[知命]",
		["color"]=249, 
	},
	["亡灵冲锋守卫"] = {
 		["key_name"]=[[亡灵冲锋守卫]],
		["color"]=249, 
	},
	["亡灵大副"] = {
 		["key_name"]=[[亡灵大副]],
		["color"]=249, 
	},
	["亡灵巨锤守卫"] = {
 		["key_name"]=[[亡灵巨锤守卫]],
		["color"]=249, 
	},
	["亡灵苦力"] = {
 		["key_name"]=[[亡灵苦力]],
		["color"]=249, 
	},
	["亡灵狂战士"] = {
 		["key_name"]=[[亡灵狂战士]],
		["color"]=249, 
	},
	["亡灵哨兵"] = {
 		["key_name"]=[[亡灵哨兵]],
		["color"]=249, 
	},
	["亡灵巡逻兵"] = {
 		["key_name"]=[[亡灵巡逻兵]],
		["color"]=249, 
	},
	["亡灵长矛兵"] = {
 		["key_name"]=[[亡灵长矛兵]],
		["color"]=249, 
	},
	["卧龙卫士(火)"] = {
 		["key_name"]=[[卧龙卫士(火)]],
		["color"]=249, 
	},
	["卧龙卫士(金)"] = {
 		["key_name"]=[[卧龙卫士(金)]],
		["color"]=249, 
	},
	["卧龙卫士(木)"] = {
 		["key_name"]=[[卧龙卫士(木)]],
		["color"]=249, 
	},
	["卧龙卫士(水)"] = {
 		["key_name"]=[[卧龙卫士(水)]],
		["color"]=249, 
	},
	["卧龙卫士(土)"] = {
 		["key_name"]=[[卧龙卫士(土)]],
		["color"]=249, 
	},
	["卧龙庄主"] = {
 		["key_name"]=[[卧龙庄主]],
		["color"]=249, 
	},
	["巫妖护法"] = {
 		["key_name"]=[[巫妖护法]],
		["color"]=249, 
	},
	["巫妖护卫"] = {
 		["key_name"]=[[巫妖护卫]],
		["color"]=249, 
	},
	["巫妖祭祀"] = {
 		["key_name"]=[[巫妖祭祀]],
		["color"]=249, 
	},
	["巫妖猎人"] = {
 		["key_name"]=[[巫妖猎人]],
		["color"]=249, 
	},
	["午时三刻饿死鬼"] = {
 		["key_name"]=[[午时三刻饿死鬼]],
		["color"]=249, 
	},
	["峡谷虎精"] = {
 		["key_name"]=[[峡谷虎精]],
		["color"]=249, 
	},
	["峡谷剑客"] = {
 		["key_name"]=[[峡谷剑客]],
		["color"]=249, 
	},
	["峡谷树精"] = {
 		["key_name"]=[[峡谷树精]],
		["color"]=249, 
	},
	["峡谷行者"] = {
 		["key_name"]=[[峡谷行者]],
		["color"]=249, 
	},
	["仙境蛟龙"] = {
 		["key_name"]=[[仙境蛟龙]],
		["color"]=249, 
	},
	["仙境蛇妖"] = {
 		["key_name"]=[[仙境蛇妖]],
		["color"]=249, 
	},
	["仙境猪妖"] = {
 		["key_name"]=[[仙境猪妖]],
		["color"]=249, 
	},
	["猩红女仆"] = {
 		["key_name"]=[[猩红女仆]],
		["color"]=249, 
	},
	["修罗王·麒麟将军"] = {
 		["key_name"]=[[修罗王·麒麟将军]],
		["color"]=249, 
	},
	["修罗王·上古剑圣"] = {
 		["key_name"]=[[修罗王·上古剑圣]],
		["color"]=249, 
	},
	["修罗王·神秘海妖"] = {
 		["key_name"]=[[修罗王·神秘海妖]],
		["color"]=249, 
	},
	["修罗王·嗜血兽王"] = {
 		["key_name"]=[[修罗王·嗜血兽王]],
		["color"]=249, 
	},
	["修罗王·天蓬魔眼"] = {
 		["key_name"]=[[修罗王·天蓬魔眼]],
		["color"]=249, 
	},
	["修罗王·幽冥厉鬼"] = {
 		["key_name"]=[[修罗王·幽冥厉鬼]],
		["color"]=249, 
	},
	["玄武·五行神兽"] = {
 		["key_name"]=[[玄武·五行神兽]],
		["color"]=249, 
	},
	["血尸"] = {
 		["key_name"]=[[血尸]],
		["color"]=249, 
	},
	["血藤魔兽"] = {
 		["key_name"]=[[血藤魔兽]],
		["color"]=249, 
	},
	["妖·盗宝地精"] = {
 		["key_name"]=[[妖·盗宝地精]],
		["color"]=249, 
	},
	["妖·夺魂鬼"] = {
 		["key_name"]=[[妖·夺魂鬼]],
		["color"]=249, 
	},
	["妖·黄金统领"] = {
 		["key_name"]=[[妖·黄金统领]],
		["color"]=249, 
	},
	["妖·收尸鬼"] = {
 		["key_name"]=[[妖·收尸鬼]],
		["color"]=249, 
	},
	["妖·索命鬼"] = {
 		["key_name"]=[[妖·索命鬼]],
		["color"]=249, 
	},
	["妖·通灵大魔王"] = {
 		["key_name"]=[[妖·通灵大魔王]],
		["color"]=249, 
	},
	["遗迹圣殿祭祀"] = {
 		["key_name"]=[[遗迹圣殿祭祀]],
		["color"]=249, 
	},
	["遗迹圣殿将军"] = {
 		["key_name"]=[[遗迹圣殿将军]],
		["color"]=249, 
	},
	["遗迹圣殿守卫"] = {
 		["key_name"]=[[遗迹圣殿守卫]],
		["color"]=249, 
	},
	["遗忘火蜥蜴"] = {
 		["key_name"]=[[遗忘火蜥蜴]],
		["color"]=249, 
	},
	["遗忘利齿兵"] = {
 		["key_name"]=[[遗忘利齿兵]],
		["color"]=249, 
	},
	["遗忘石巨人"] = {
 		["key_name"]=[[遗忘石巨人]],
		["color"]=249, 
	},
	["遗忘铁血卫"] = {
 		["key_name"]=[[遗忘铁血卫]],
		["color"]=249, 
	},
	["异界★·堕天罗汉"] = {
 		["key_name"]=[[异界★·堕天罗汉]],
		["color"]=249, 
	},
	["异界★·荒神祭司"] = {
 		["key_name"]=[[异界★·荒神祭司]],
		["color"]=249, 
	},
	["异界★★·厄加魔王"] = {
 		["key_name"]=[[异界★★·厄加魔王]],
		["color"]=249, 
	},
	["异界★★·轮回执事"] = {
 		["key_name"]=[[异界★★·轮回执事]],
		["color"]=249, 
	},
	["异界★★·深渊引水"] = {
 		["key_name"]=[[异界★★·深渊引水]],
		["color"]=249, 
	},
	["异界★★·守墓死侍"] = {
 		["key_name"]=[[异界★★·守墓死侍]],
		["color"]=249, 
	},
	["异界★★·虚空观测"] = {
 		["key_name"]=[[异界★★·虚空观测]],
		["color"]=249, 
	},
	["异界★★·镇魔明王"] = {
 		["key_name"]=[[异界★★·镇魔明王]],
		["color"]=249, 
	},
	["异界★★★·不朽屠穹"] = {
 		["key_name"]=[[异界★★★·不朽屠穹]],
		["color"]=249, 
	},
	["异界★★★·轮回佛陀"] = {
 		["key_name"]=[[异界★★★·轮回佛陀]],
		["color"]=249, 
	},
	["异界★★★·时空使者"] = {
 		["key_name"]=[[异界★★★·时空使者]],
		["color"]=249, 
	},
	["异界★★★·引渡死神"] = {
 		["key_name"]=[[异界★★★·引渡死神]],
		["color"]=249, 
	},
	["异界★★★·永劫伯爵"] = {
 		["key_name"]=[[异界★★★·永劫伯爵]],
		["color"]=249, 
	},
	["异界★★★·灾厄船长"] = {
 		["key_name"]=[[异界★★★·灾厄船长]],
		["color"]=249, 
	},
	["异界★★★★·混沌之主"] = {
 		["key_name"]=[[异界★★★★·混沌之主]],
		["color"]=249, 
	},
	["异界★★★★·永夜主宰"] = {
 		["key_name"]=[[异界★★★★·永夜主宰]],
		["color"]=249, 
	},
	["异界★★★★★·寂灭方舟"] = {
 		["key_name"]=[[异界★★★★★·寂灭方舟]],
		["color"]=249, 
	},
	["异界★★★★★·时空之主"] = {
 		["key_name"]=[[异界★★★★★·时空之主]],
		["color"]=249, 
	},
	["远古霸王守卫"] = {
 		["key_name"]=[[远古霸王守卫]],
		["color"]=249, 
	},
	["远古红眼祭祀"] = {
 		["key_name"]=[[远古红眼祭祀]],
		["color"]=249, 
	},
	["远古骷髅剑灵"] = {
 		["key_name"]=[[远古骷髅剑灵]],
		["color"]=249, 
	},
	["远古骷髅精灵"] = {
 		["key_name"]=[[远古骷髅精灵]],
		["color"]=249, 
	},
	["怨恨·魔族骑士"] = {
 		["key_name"]=[[怨恨·魔族骑士]],
		["color"]=249, 
	},
	["怨恨的地狱守卫"] = {
 		["key_name"]=[[怨恨的地狱守卫]],
		["color"]=249, 
	},
	["怨恨的虎头先锋"] = {
 		["key_name"]=[[怨恨的虎头先锋]],
		["color"]=249, 
	},
	["怨恨的索命鬼王"] = {
 		["key_name"]=[[怨恨的索命鬼王]],
		["color"]=249, 
	},
	["怨灵炮手"] = {
 		["key_name"]=[[怨灵炮手]],
		["color"]=249, 
	},
	["招财黄金蟾"] = {
 		["key_name"]=[[招财黄金蟾]],
		["color"]=249, 
	},
	["重生の大水牛"] = {
 		["key_name"]=[[重生の大水牛]],
		["color"]=249, 
	},
	["朱雀·五行神兽"] = {
 		["key_name"]=[[朱雀·五行神兽]],
		["color"]=249, 
	},
	["粽子"] = {
 		["key_name"]=[[粽子]],
		["color"]=249, 
	},
	["诅咒骷髅王"] = {
 		["key_name"]=[[诅咒骷髅王]],
		["color"]=249, 
	},
	["罪恶·伏虎尊者"] = {
 		["key_name"]=[[罪恶·伏虎尊者]],
		["color"]=249, 
	},
	["罪恶的降龙罗汉"] = {
 		["key_name"]=[[罪恶的降龙罗汉]],
		["color"]=249, 
	},
	["罪恶的天兵守卫"] = {
 		["key_name"]=[[罪恶的天兵守卫]],
		["color"]=249, 
	},
	["罪恶的天将守卫"] = {
 		["key_name"]=[[罪恶的天将守卫]],
		["color"]=249, 
	},  
}
 return config;