local config = {
	[1] = {
 		["key_name"]=1,
		["award1_map"]={[1]={"三倍秘境卷轴",1,},[2]={"书页",38,},[3]={"五彩石",58,},[4]={"绑定金刚石",588,},}, 
	},
	[2] = {
 		["key_name"]=2,
		["award1_map"]={[1]={"三倍秘境卷轴",1,},[2]={"书页",38,},[3]={"五彩石",58,},[4]={"绑定金刚石",588,},}, 
	},
	[3] = {
 		["key_name"]=3,
		["award1_map"]={[1]={"三倍秘境卷轴",1,},[2]={"书页",38,},[3]={"五彩石",58,},[4]={"绑定金刚石",588,},}, 
	},
	[4] = {
 		["key_name"]=4,
		["award1_map"]={[1]={"三倍秘境卷轴",1,},[2]={"书页",38,},[3]={"五彩石",58,},[4]={"绑定金刚石",588,},}, 
	},
	[5] = {
 		["key_name"]=5,
		["award1_map"]={[1]={"三倍秘境卷轴",1,},[2]={"书页",38,},[3]={"五彩石",58,},[4]={"绑定金刚石",588,},}, 
	},
	[6] = {
 		["key_name"]=6,
		["award1_map"]={[1]={"三倍秘境卷轴",1,},[2]={"书页",38,},[3]={"五彩石",58,},[4]={"绑定金刚石",588,},}, 
	},
	[7] = {
 		["key_name"]=7,
		["award1_map"]={[1]={"三倍秘境卷轴",1,},[2]={"书页",38,},[3]={"五彩石",58,},[4]={"绑定金刚石",588,},}, 
	},
}
return config