---alg工作台
---xls转lua table
---时间:Mon Jul 07 15:09:06 CST 2025
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]="卧龙守将",
		["info_arr"]={"斩浪","青城","新月","御风","风云",}, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]="卧龙庄主",
		["info_arr"]={"火龙之心(金)","火龙之心(木)","火龙之心(水)","火龙之心(火)","火龙之心(土)",}, 
	},
	[3] = {
 		["key_name"]=3,
		["type"]="诛仙之力",
		["info_config"]={{"火龙之心(金)",1},{"火龙之心(木)",1},{"火龙之心(水)",1},{"火龙之心(火)",1},{"火龙之心(土)",1},{"灵符",20000},}, 
	},
	["斩浪"] = {
 		["key_name"]="斩浪",
		["info_arr"]={"绑定金刚石",18800,"智慧魔石",1,},
		["info_config"]={"卧龙山庄",181,40}, 
	},
	["青城"] = {
 		["key_name"]="青城",
		["info_arr"]={"绑定金刚石",18800,"力量魔石",1,},
		["info_config"]={"卧龙山庄",200,205}, 
	},
	["新月"] = {
 		["key_name"]="新月",
		["info_arr"]={"绑定金刚石",18800,"自然魔石",1,},
		["info_config"]={"卧龙山庄",154,140}, 
	},
	["御风"] = {
 		["key_name"]="御风",
		["info_arr"]={"绑定金刚石",18800,"权利魔石",1,},
		["info_config"]={"卧龙山庄",30,200}, 
	},
	["风云"] = {
 		["key_name"]="风云",
		["info_arr"]={"绑定金刚石",18800,"黑暗魔石",1,},
		["info_config"]={"卧龙山庄",85,150}, 
	},  
}
 return config;