---alg工作台
---xls转lua table
---时间:Fri Jul 18 16:01:37 CST 2025
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["level"]=1,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,}, 
	},
	[2] = {
 		["key_name"]=2,
		["level"]=2,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,}, 
	},
	[3] = {
 		["key_name"]=3,
		["level"]=3,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,}, 
	},
	[4] = {
 		["key_name"]=4,
		["level"]=4,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,}, 
	},
	[5] = {
 		["key_name"]=5,
		["level"]=5,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,}, 
	},
	[6] = {
 		["key_name"]=6,
		["level"]=6,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,}, 
	},
	[7] = {
 		["key_name"]=7,
		["level"]=7,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,}, 
	},
	[8] = {
 		["key_name"]=8,
		["level"]=8,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,}, 
	},
	[9] = {
 		["key_name"]=9,
		["level"]=9,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,}, 
	},
	[10] = {
 		["key_name"]=10,
		["level"]=10,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="无知的初心", 
	},
	[11] = {
 		["key_name"]=11,
		["level"]=11,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[12] = {
 		["key_name"]=12,
		["level"]=12,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[13] = {
 		["key_name"]=13,
		["level"]=13,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[14] = {
 		["key_name"]=14,
		["level"]=14,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[15] = {
 		["key_name"]=15,
		["level"]=15,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="敬畏的黑夜", 
	},
	[16] = {
 		["key_name"]=16,
		["level"]=16,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[17] = {
 		["key_name"]=17,
		["level"]=17,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[18] = {
 		["key_name"]=18,
		["level"]=18,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[19] = {
 		["key_name"]=19,
		["level"]=19,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[20] = {
 		["key_name"]=20,
		["level"]=20,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="荆棘的宁静", 
	},
	[21] = {
 		["key_name"]=21,
		["level"]=21,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[22] = {
 		["key_name"]=22,
		["level"]=22,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[23] = {
 		["key_name"]=23,
		["level"]=23,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[24] = {
 		["key_name"]=24,
		["level"]=24,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[25] = {
 		["key_name"]=25,
		["level"]=25,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="迷失的国度", 
	},
	[26] = {
 		["key_name"]=26,
		["level"]=26,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[27] = {
 		["key_name"]=27,
		["level"]=27,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[28] = {
 		["key_name"]=28,
		["level"]=28,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[29] = {
 		["key_name"]=29,
		["level"]=29,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[30] = {
 		["key_name"]=30,
		["level"]=30,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="堕落的天使", 
	},
	[31] = {
 		["key_name"]=31,
		["level"]=31,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[32] = {
 		["key_name"]=32,
		["level"]=32,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[33] = {
 		["key_name"]=33,
		["level"]=33,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[34] = {
 		["key_name"]=34,
		["level"]=34,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[35] = {
 		["key_name"]=35,
		["level"]=35,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="秩序的混乱", 
	},
	[36] = {
 		["key_name"]=36,
		["level"]=36,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[37] = {
 		["key_name"]=37,
		["level"]=37,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[38] = {
 		["key_name"]=38,
		["level"]=38,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[39] = {
 		["key_name"]=39,
		["level"]=39,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[40] = {
 		["key_name"]=40,
		["level"]=40,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="信仰的秘密", 
	},
	[41] = {
 		["key_name"]=41,
		["level"]=41,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[42] = {
 		["key_name"]=42,
		["level"]=42,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[43] = {
 		["key_name"]=43,
		["level"]=43,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[44] = {
 		["key_name"]=44,
		["level"]=44,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[45] = {
 		["key_name"]=45,
		["level"]=45,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="无尽的雷鸣", 
	},
	[46] = {
 		["key_name"]=46,
		["level"]=46,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[47] = {
 		["key_name"]=47,
		["level"]=47,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[48] = {
 		["key_name"]=48,
		["level"]=48,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[49] = {
 		["key_name"]=49,
		["level"]=49,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[50] = {
 		["key_name"]=50,
		["level"]=50,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="魔神的召唤", 
	},
	[51] = {
 		["key_name"]=51,
		["level"]=51,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[52] = {
 		["key_name"]=52,
		["level"]=52,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[53] = {
 		["key_name"]=53,
		["level"]=53,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[54] = {
 		["key_name"]=54,
		["level"]=54,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[55] = {
 		["key_name"]=55,
		["level"]=55,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="众神的覆灭", 
	},
	[56] = {
 		["key_name"]=56,
		["level"]=56,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[57] = {
 		["key_name"]=57,
		["level"]=57,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[58] = {
 		["key_name"]=58,
		["level"]=58,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[59] = {
 		["key_name"]=59,
		["level"]=59,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[60] = {
 		["key_name"]=60,
		["level"]=60,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="宿命的羁绊", 
	},
	[61] = {
 		["key_name"]=61,
		["level"]=61,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[62] = {
 		["key_name"]=62,
		["level"]=62,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[63] = {
 		["key_name"]=63,
		["level"]=63,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[64] = {
 		["key_name"]=64,
		["level"]=64,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[65] = {
 		["key_name"]=65,
		["level"]=65,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="命运的抉择", 
	},
	[66] = {
 		["key_name"]=66,
		["level"]=66,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[67] = {
 		["key_name"]=67,
		["level"]=67,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[68] = {
 		["key_name"]=68,
		["level"]=68,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[69] = {
 		["key_name"]=69,
		["level"]=69,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[70] = {
 		["key_name"]=70,
		["level"]=70,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="黎明的前夕", 
	},
	[71] = {
 		["key_name"]=71,
		["level"]=71,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[72] = {
 		["key_name"]=72,
		["level"]=72,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[73] = {
 		["key_name"]=73,
		["level"]=73,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[74] = {
 		["key_name"]=74,
		["level"]=74,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[75] = {
 		["key_name"]=75,
		["level"]=75,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="无尽的挑战", 
	},
	[76] = {
 		["key_name"]=76,
		["level"]=76,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[77] = {
 		["key_name"]=77,
		["level"]=77,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[78] = {
 		["key_name"]=78,
		["level"]=78,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[79] = {
 		["key_name"]=79,
		["level"]=79,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[80] = {
 		["key_name"]=80,
		["level"]=80,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="极限的突破", 
	},
	[81] = {
 		["key_name"]=81,
		["level"]=81,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[82] = {
 		["key_name"]=82,
		["level"]=82,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[83] = {
 		["key_name"]=83,
		["level"]=83,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[84] = {
 		["key_name"]=84,
		["level"]=84,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[85] = {
 		["key_name"]=85,
		["level"]=85,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="重生·复仇女神", 
	},
	[86] = {
 		["key_name"]=86,
		["level"]=86,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[87] = {
 		["key_name"]=87,
		["level"]=87,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[88] = {
 		["key_name"]=88,
		["level"]=88,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[89] = {
 		["key_name"]=89,
		["level"]=89,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[90] = {
 		["key_name"]=90,
		["level"]=90,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="觉醒·毕方之炎", 
	},
	[91] = {
 		["key_name"]=91,
		["level"]=91,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[92] = {
 		["key_name"]=92,
		["level"]=92,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[93] = {
 		["key_name"]=93,
		["level"]=93,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[94] = {
 		["key_name"]=94,
		["level"]=94,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[95] = {
 		["key_name"]=95,
		["level"]=95,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="史诗·超越征程", 
	},
	[96] = {
 		["key_name"]=96,
		["level"]=96,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[97] = {
 		["key_name"]=97,
		["level"]=97,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[98] = {
 		["key_name"]=98,
		["level"]=98,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},
	[99] = {
 		["key_name"]=99,
		["level"]=99,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
		["title"]="宗师·开山立派", 
	},
	[100] = {
 		["key_name"]=100,
		["level"]=100,
		["giveitem_map"]={["元宝"]=10000,["绑定金刚石"]=100,["声望"]=100,},
	},  
}
 return config;