--- 为避免协议id冲突,把通用协议ID整理到这里,方便版本复用
--------------------------------------------------
------------ msgId <10000 为公共协议----------------
--------------------------------------------------

-------------------- S => C ----------------------
SC_MSG_SEND_DATA = 100                  -- 服务器发送数据到客户端
SC_MSG_SHOW_VIEW = 1000                 -- 打开npc面板
SC_MSG_CLOSE_VIEW = 1001                -- 关闭npc面板
SC_MSG_FLUSH_VIEW = 1002                -- 刷新npc面板
SC_MSG_SHOW_AWARD_TIP_VIEW = 1003       -- 打开获得道具奖励面板
SC_MSG_CALL_CLIENT_FUNC = 1004          -- 调用客户端指定函数


-------------------- C => S ----------------------
CS_MSG_CLICK_NPC = 100                  -- 客户端发送协议到服务器 点击了npc
CS_MSG_CALL_FUN_BY_NPC = 101            -- 客户端发送协议到服务器 调用指定Npc脚本的指定函数
CS_MSG_CLICK_MAIN_BTN = 102             -- 客户端发送协议到服务器 点击游戏主界面按钮
CS_MSG_CLICK_SYS_BTN = 103              -- 客户端发送协议到服务器 点击游戏中的一些系统面板上的按钮
CS_MSG_SEND_DATA = 200                  -- 客户端发送数据到服务器

