---alg工作台
---xls转lua table
---时间:Thu Jun 26 15:46:30 CST 2025
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]="上古",
		["equip_arr"]={"上古生肖",}, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]="传承",
		["equip_arr"]={"传承生肖",}, 
	},
	["上古生肖"] = {
 		["key_name"]="上古生肖",
		["equip_arr"]={"上古·生肖(鼠)","上古·生肖(牛)","上古·生肖(虎)","上古·生肖(兔)","上古·生肖(龍)","上古·生肖(蛇)","上古·生肖(馬)","上古·生肖(羊)","上古·生肖(猴)","上古·生肖(鸡)","上古·生肖(狗)","上古·生肖(猪)",},
		["need_config"]={{"生肖",2},{"元宝",5000},{"金刚石",200},}, 
	},
	["传承生肖"] = {
 		["key_name"]="传承生肖",
		["equip_arr"]={"传承·生肖(鼠)","传承·生肖(牛)","传承·生肖(虎)","传承·生肖(兔)","传承·生肖(龍)","传承·生肖(蛇)","传承·生肖(馬)","传承·生肖(羊)","传承·生肖(猴)","传承·生肖(鸡)","传承·生肖(狗)","传承·生肖(猪)",},
		["need_config"]={{"上古·生肖",2},{"元宝",5000},{"金刚石",200},}, 
	},  
}
 return config;