---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["type"]="斗笠",
		["equip_arr"]={"赤月斗笠","魔龙斗笠","战神斗笠","火龙斗笠","天龙斗笠","神龙斗笠","聖龍斗笠","宗师斗笠",},
		["position"]=13, 
	},
	[2] = {
 		["key_name"]=2,
		["type"]="勋章",
		["equip_arr"]={"赤月勋章","魔龙勋章","战神勋章","火龙勋章","天龙勋章","神龙勋章","聖龍勋章","宗师勋章",},
		["position"]=2, 
	},
	[3] = {
 		["key_name"]=3,
		["type"]="魔血石",
		["equip_arr"]={"二星魔血石","三星魔血石","四星魔血石","五星魔血石","六星魔血石","七星魔血石","八星魔血石","九星魔血石","魔血石·MAX",},
		["position"]=12, 
	},
	[4] = {
 		["key_name"]=4,
		["type"]="盾牌",
		["equip_arr"]={"赤月盾牌","魔龙盾牌","战神盾牌","火龙盾牌","天龙盾牌","神龙盾牌","聖龍盾牌","宗师盾牌",},
		["position"]=16, 
	},
	[5] = {
 		["key_name"]=5,
		["type"]="兵符",
		["equip_arr"]={"赤月兵符","魔龙兵符","战神兵符","火龙兵符","天龙兵符","神龙兵符","聖龍兵符","宗师兵符",},
		["position"]=9, 
	},
	["赤月斗笠"] = {
 		["key_name"]="赤月斗笠",
		["need_config"]={{"祖玛斗笠",2},{"元宝",2000},}, 
	},
	["魔龙斗笠"] = {
 		["key_name"]="魔龙斗笠",
		["need_config"]={{"赤月斗笠",2},{"元宝",5000},}, 
	},
	["战神斗笠"] = {
 		["key_name"]="战神斗笠",
		["need_config"]={{"魔龙斗笠",2},{"元宝",10000},}, 
	},
	["火龙斗笠"] = {
 		["key_name"]="火龙斗笠",
		["need_config"]={{"战神斗笠",2},{"元宝",20000},{"金刚石",1000},}, 
	},
	["天龙斗笠"] = {
 		["key_name"]="天龙斗笠",
		["need_config"]={{"火龙斗笠",2},{"元宝",30000},{"金刚石",1500},}, 
	},
	["神龙斗笠"] = {
 		["key_name"]="神龙斗笠",
		["need_config"]={{"天龙斗笠",2},{"元宝",50000},{"金刚石",2000},}, 
	},
	["聖龍斗笠"] = {
 		["key_name"]="聖龍斗笠",
		["level1"]=60,
		["need_config"]={{"神龙斗笠",1},{"元宝",100000},{"龙之心",99},}, 
	},
	["宗师斗笠"] = {
 		["key_name"]="宗师斗笠",
		["level2"]=5,
		["need_config"]={{"聖龍斗笠",1},{"元宝",200000},{"龙之心",999},}, 
	},
	["赤月勋章"] = {
 		["key_name"]="赤月勋章",
		["need_config"]={{"祖玛勋章",2},{"元宝",2000},}, 
	},
	["魔龙勋章"] = {
 		["key_name"]="魔龙勋章",
		["need_config"]={{"赤月勋章",2},{"元宝",5000},}, 
	},
	["战神勋章"] = {
 		["key_name"]="战神勋章",
		["need_config"]={{"魔龙勋章",2},{"元宝",10000},}, 
	},
	["火龙勋章"] = {
 		["key_name"]="火龙勋章",
		["need_config"]={{"战神勋章",2},{"元宝",20000},{"金刚石",1000},}, 
	},
	["天龙勋章"] = {
 		["key_name"]="天龙勋章",
		["need_config"]={{"火龙勋章",2},{"元宝",30000},{"金刚石",1500},}, 
	},
	["神龙勋章"] = {
 		["key_name"]="神龙勋章",
		["need_config"]={{"天龙勋章",2},{"元宝",50000},{"金刚石",2000},}, 
	},
	["聖龍勋章"] = {
 		["key_name"]="聖龍勋章",
		["level1"]=60,
		["need_config"]={{"神龙勋章",1},{"元宝",100000},{"龙之心",99},}, 
	},
	["宗师勋章"] = {
 		["key_name"]="宗师勋章",
		["level2"]=5,
		["need_config"]={{"聖龍勋章",1},{"元宝",200000},{"龙之心",999},}, 
	},
	["二星魔血石"] = {
 		["key_name"]="二星魔血石",
		["need_config"]={{"一星魔血石",2},{"元宝",1000},}, 
	},
	["三星魔血石"] = {
 		["key_name"]="三星魔血石",
		["need_config"]={{"二星魔血石",2},{"元宝",2000},}, 
	},
	["四星魔血石"] = {
 		["key_name"]="四星魔血石",
		["need_config"]={{"三星魔血石",2},{"元宝",3000},{"金刚石",100},}, 
	},
	["五星魔血石"] = {
 		["key_name"]="五星魔血石",
		["need_config"]={{"四星魔血石",2},{"元宝",5000},{"金刚石",200},}, 
	},
	["六星魔血石"] = {
 		["key_name"]="六星魔血石",
		["need_config"]={{"五星魔血石",2},{"元宝",10000},{"金刚石",300},}, 
	},
	["七星魔血石"] = {
 		["key_name"]="七星魔血石",
		["need_config"]={{"六星魔血石",2},{"元宝",15000},{"金刚石",500},}, 
	},
	["八星魔血石"] = {
 		["key_name"]="八星魔血石",
		["need_config"]={{"七星魔血石",2},{"元宝",20000},{"金刚石",1000},}, 
	},
	["九星魔血石"] = {
 		["key_name"]="九星魔血石",
		["need_config"]={{"八星魔血石",2},{"元宝",50000},{"金刚石",2000},}, 
	},
	["魔血石·MAX"] = {
 		["key_name"]="魔血石·MAX",
		["need_config"]={{"九星魔血石",1},{"元宝",100000},{"龙之心",99},}, 
	},
	["赤月盾牌"] = {
 		["key_name"]="赤月盾牌",
		["need_config"]={{"祖玛盾牌",2},{"元宝",2000},}, 
	},
	["魔龙盾牌"] = {
 		["key_name"]="魔龙盾牌",
		["need_config"]={{"赤月盾牌",2},{"元宝",5000},}, 
	},
	["战神盾牌"] = {
 		["key_name"]="战神盾牌",
		["need_config"]={{"魔龙盾牌",2},{"元宝",10000},}, 
	},
	["火龙盾牌"] = {
 		["key_name"]="火龙盾牌",
		["need_config"]={{"战神盾牌",2},{"元宝",20000},{"金刚石",1000},}, 
	},
	["天龙盾牌"] = {
 		["key_name"]="天龙盾牌",
		["need_config"]={{"火龙盾牌",2},{"元宝",30000},{"金刚石",1500},}, 
	},
	["神龙盾牌"] = {
 		["key_name"]="神龙盾牌",
		["need_config"]={{"天龙盾牌",2},{"元宝",50000},{"金刚石",2000},}, 
	},
	["聖龍盾牌"] = {
 		["key_name"]="聖龍盾牌",
		["level1"]=50,
		["need_config"]={{"神龙盾牌",1},{"元宝",100000},{"龙之心",99},}, 
	},
	["宗师盾牌"] = {
 		["key_name"]="宗师盾牌",
		["level2"]=5,
		["need_config"]={{"聖龍盾牌",1},{"元宝",200000},{"龙之心",999},}, 
	},
	["赤月兵符"] = {
 		["key_name"]="赤月兵符",
		["need_config"]={{"祖玛兵符",2},{"元宝",2000},}, 
	},
	["魔龙兵符"] = {
 		["key_name"]="魔龙兵符",
		["need_config"]={{"赤月兵符",2},{"元宝",5000},}, 
	},
	["战神兵符"] = {
 		["key_name"]="战神兵符",
		["need_config"]={{"魔龙兵符",2},{"元宝",10000},}, 
	},
	["火龙兵符"] = {
 		["key_name"]="火龙兵符",
		["need_config"]={{"战神兵符",2},{"元宝",20000},{"金刚石",1000},}, 
	},
	["天龙兵符"] = {
 		["key_name"]="天龙兵符",
		["need_config"]={{"火龙兵符",2},{"元宝",30000},{"金刚石",1500},}, 
	},
	["神龙兵符"] = {
 		["key_name"]="神龙兵符",
		["need_config"]={{"天龙兵符",2},{"元宝",50000},{"金刚石",2000},}, 
	},
	["聖龍兵符"] = {
 		["key_name"]="聖龍兵符",
		["level1"]=50,
		["need_config"]={{"神龙兵符",1},{"元宝",100000},{"龙之心",99},}, 
	},
	["宗师兵符"] = {
 		["key_name"]="宗师兵符",
		["level2"]=5,
		["need_config"]={{"聖龍兵符",1},{"元宝",200000},{"龙之心",999},}, 
	},  
}
 return config;