---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["boss_list"]=[[玄冰剑尊·紫宸|苍玄法圣·墨渊|幽蓝妖姬·溟汐|赤阳神君·燎天]],
		["zhuashu_drop"]=[[一阶天神风剑,1#一阶霸王风剑,1|一阶炽热风剑,1#一阶神罚风剑,1|一阶大地风剑,1#一阶明月风剑,1|一阶山川风剑,1#一阶大海风剑,1]],
		["kill_award"]=[[飞剑碎片#1&战令#100&金刚石#100&声望#100]], 
	},
	[2] = {
 		["key_name"]=2,
		["boss_list"]=[[玄冰剑尊·紫宸1|苍玄法圣·墨渊1|幽蓝妖姬·溟汐1|赤阳神君·燎天1]],
		["need_equip"]=[[一阶天神风剑|一阶霸王风剑|一阶炽热风剑|一阶神罚风剑|一阶大地风剑|一阶明月风剑|一阶山川风剑|一阶大海风剑]],
		["zhuashu_drop"]=[[二阶天神风剑,1#二阶霸王风剑,1|二阶炽热风剑,1#二阶神罚风剑,1|二阶大地风剑,1#二阶明月风剑,1|二阶山川风剑,1#二阶大海风剑,1]],
		["kill_award"]=[[飞剑碎片#1&战令#100&金刚石#100&声望#100]], 
	},
	[3] = {
 		["key_name"]=3,
		["boss_list"]=[[玄冰剑尊·紫宸2|苍玄法圣·墨渊2|幽蓝妖姬·溟汐2|赤阳神君·燎天2]],
		["need_equip"]=[[二阶天神风剑|二阶霸王风剑|二阶炽热风剑|二阶神罚风剑|二阶大地风剑|二阶明月风剑|二阶山川风剑|二阶大海风剑]],
		["zhuashu_drop"]=[[三阶天神风剑,1#三阶霸王风剑,1|三阶炽热风剑,1#三阶神罚风剑,1|三阶大地风剑,1#三阶明月风剑,1|三阶山川风剑,1#三阶大海风剑,1]],
		["kill_award"]=[[飞剑碎片#1&战令#100&金刚石#100&声望#100]], 
	},
	[4] = {
 		["key_name"]=4,
		["boss_list"]=[[玄冰剑尊·紫宸3|苍玄法圣·墨渊3|幽蓝妖姬·溟汐3|赤阳神君·燎天3]],
		["need_equip"]=[[三阶天神风剑|三阶霸王风剑|三阶炽热风剑|三阶神罚风剑|三阶大地风剑|三阶明月风剑|三阶山川风剑|三阶大海风剑]],
		["zhuashu_drop"]=[[四阶天神风剑,1#四阶霸王风剑,1|四阶炽热风剑,1#四阶神罚风剑,1|四阶大地风剑,1#四阶明月风剑,1|四阶山川风剑,1#四阶大海风剑,1]],
		["kill_award"]=[[飞剑碎片#1&战令#100&金刚石#100&声望#100]], 
	},
	[5] = {
 		["key_name"]=5,
		["boss_list"]=[[玄冰剑尊·紫宸4|苍玄法圣·墨渊4|幽蓝妖姬·溟汐4|赤阳神君·燎天4]],
		["need_equip"]=[[四阶天神风剑|四阶霸王风剑|四阶炽热风剑|四阶神罚风剑|四阶大地风剑|四阶明月风剑|四阶山川风剑|四阶大海风剑]],
		["zhuashu_drop"]=[[五阶天神风剑,1#五阶霸王风剑,1|五阶炽热风剑,1#五阶神罚风剑,1|五阶大地风剑,1#五阶明月风剑,1|五阶山川风剑,1#五阶大海风剑,1]],
		["kill_award"]=[[飞剑碎片#1&战令#100&金刚石#100&声望#100]], 
	},
	[6] = {
 		["key_name"]=6,
		["boss_list"]=[[玄冰剑尊·紫宸5|苍玄法圣·墨渊5|幽蓝妖姬·溟汐5|赤阳神君·燎天5]],
		["need_equip"]=[[五阶天神风剑|五阶霸王风剑|五阶炽热风剑|五阶神罚风剑|五阶大地风剑|五阶明月风剑|五阶山川风剑|五阶大海风剑]],
		["zhuashu_drop"]=[[六阶天神风剑,1#六阶霸王风剑,1|六阶炽热风剑,1#六阶神罚风剑,1|六阶大地风剑,1#六阶明月风剑,1|六阶山川风剑,1#六阶大海风剑,1]],
		["kill_award"]=[[飞剑碎片#1&战令#100&金刚石#100&声望#100]], 
	},
	[7] = {
 		["key_name"]=7,
		["boss_list"]=[[玄冰剑尊·紫宸6|苍玄法圣·墨渊6|幽蓝妖姬·溟汐6|赤阳神君·燎天6]],
		["need_equip"]=[[六阶天神风剑|六阶霸王风剑|六阶炽热风剑|六阶神罚风剑|六阶大地风剑|六阶明月风剑|六阶山川风剑|六阶大海风剑]],
		["zhuashu_drop"]=[[七阶天神风剑,1#七阶霸王风剑,1|七阶炽热风剑,1#七阶神罚风剑,1|七阶大地风剑,1#七阶明月风剑,1|七阶山川风剑,1#七阶大海风剑,1]],
		["kill_award"]=[[飞剑碎片#1&战令#100&金刚石#100&声望#100]], 
	},
	[8] = {
 		["key_name"]=8,
		["boss_list"]=[[玄冰剑尊·紫宸7|苍玄法圣·墨渊7|幽蓝妖姬·溟汐7|赤阳神君·燎天7]],
		["need_equip"]=[[七阶天神风剑|七阶霸王风剑|七阶炽热风剑|七阶神罚风剑|七阶大地风剑|七阶明月风剑|七阶山川风剑|七阶大海风剑]],
		["zhuashu_drop"]=[[八阶天神风剑,1#八阶霸王风剑,1|八阶炽热风剑,1#八阶神罚风剑,1|八阶大地风剑,1#八阶明月风剑,1|八阶山川风剑,1#八阶大海风剑,1]],
		["kill_award"]=[[飞剑碎片#1&战令#100&金刚石#100&声望#100]], 
	},  
}
 return config;