---alg工作台
---xls转lua table
---时间:Thu Jul 10 13:57:19 CST 2025
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["name"]="紫气东来",
		["odd"]=100,
		["needMaterials_map"]={["龙神石"]=99,},
		["needCurrency_map"]={["金刚石"]=100000,},
		["need_config"]={{"紫气东来(紫)",1},{"紫气东来(气)",1},{"紫气东来(东)",1},{"紫气东来(来)",1},}, 
	},
	[2] = {
 		["key_name"]=2,
		["name"]="兵临城下",
		["odd"]=100,
		["needMaterials_map"]={["龙神石"]=99,},
		["needCurrency_map"]={["金刚石"]=100000,},
		["need_config"]={{"兵临城下(兵)",1},{"兵临城下(临)",1},{"兵临城下(城)",1},{"兵临城下(下)",1},}, 
	},
	[3] = {
 		["key_name"]=3,
		["name"]="金戈铁马",
		["odd"]=100,
		["needMaterials_map"]={["龙神石"]=99,},
		["needCurrency_map"]={["金刚石"]=100000,},
		["need_config"]={{"金戈铁马(金)",1},{"金戈铁马(戈)",1},{"金戈铁马(铁)",1},{"金戈铁马(马)",1},}, 
	},
	[4] = {
 		["key_name"]=4,
		["name"]="烽火连城",
		["odd"]=100,
		["needMaterials_map"]={["龙神石"]=99,},
		["needCurrency_map"]={["金刚石"]=100000,},
		["need_config"]={{"烽火连城(烽)",1},{"烽火连城(火)",1},{"烽火连城(连)",1},{"烽火连城(城)",1},}, 
	},  
}
 return config;