---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
	[1] = {
 		["key_name"]=1,
		["xuemai_key_list"]={10712,10344,10345,10347,10346,10351,},
		["skill_list"]={"26","39","34"},
	},
	[2] = {
 		["key_name"]=2,
		["xuemai_key_list"]={10712,10346,10350,10348,10349,10344,},
		["skill_list"]={"26","39","34"},
	},
	[3] = {
 		["key_name"]=3,
		["xuemai_key_list"]={10712,10351,10355,10347,10345,10344,},
		["skill_list"]={"26","39","34"},
	},
	[4] = {
 		["key_name"]=4,
		["xuemai_key_list"]={10346,10353,10352,10350,10349,10354,},
		["skill_list"]={"13","55","51"},
	},
	[5] = {
 		["key_name"]=5,
		["xuemai_key_list"]={10346,10353,10344,10345,10347,10351,},
		["skill_list"]={"13","55","51"},
	},
	[6] = {
 		["key_name"]=6,
		["xuemai_key_list"]={10346,10353,10354,10351,10355,10347,},
		["skill_list"]={"13","55","51"},
	},
	[7] = {
 		["key_name"]=7,
		["xuemai_key_list"]={10346,10352,10344,10345,10351,10347,},
		["skill_list"]={"22","31","37"},
	},
	[8] = {
 		["key_name"]=8,
		["xuemai_key_list"]={10346,10352,10350,10347,10349,10354,},
		["skill_list"]={"22","31","37"},
	},
	[9] = {
 		["key_name"]=9,
		["xuemai_key_list"]={10352,10344,10345,10351,10347,10355,},
		["skill_list"]={"22","31","37"},
	},
	["26"]="<烈火剑法强化5重/FCOLOR=239><觉醒印记：/FCOLOR=251><炎魔印/FCOLOR=245><效果：几率灼烧目标10秒，(自身攻击力*10%)/FCOLOR=250>",
	["39"]="<开天斩强化5重/FCOLOR=239>  <觉醒印记：/FCOLOR=251><冰魔印/FCOLOR=245><效果：几率冰冻目标1秒/FCOLOR=250>",
	["34"]="<逐日剑法强化5重/FCOLOR=239><觉醒印记：/FCOLOR=251><血魔印/FCOLOR=245><效果：几率吸取目标10%当前血量回复自身/FCOLOR=250>",
	["22"]="<火墙强化5重/FCOLOR=239>    <觉醒印记：/FCOLOR=251><魔咒印/FCOLOR=245><效果：几率使目标感染红绿毒，持续30秒/FCOLOR=254>",
	["31"]="<魔法盾强化5重/FCOLOR=239>  <觉醒印记：/FCOLOR=251><金刚印/FCOLOR=245><效果：开盾状态下，每损失5%血量，增加减伤1%/FCOLOR=254>",
	["37"]="<流星火雨强化5重/FCOLOR=239><觉醒印记：/FCOLOR=251><飞龙印/FCOLOR=245><效果：几率召唤流星，在3*3范围造成10%HP真伤/FCOLOR=254>",
	["13"]="<灵魂火符强化5重/FCOLOR=239><觉醒印记：/FCOLOR=251><修罗印/FCOLOR=245><效果：几率对目标造成定身效果，持续1秒/FCOLOR=243>",
	["55"]="<召唤月灵强化5重/FCOLOR=239><觉醒印记：/FCOLOR=251><契约印/FCOLOR=245><效果：召唤月灵最大召唤数量+1/FCOLOR=243>",
	["51"]="<飓风破强化5重/FCOLOR=239>  <觉醒印记：/FCOLOR=251><暴风印/FCOLOR=245><效果：几率在3*3范围释放飓风伤害(道术*120%)/FCOLOR=243>",
	["desc_1"]="<狂战是战士职业的一种强力流派，以高爆发和高输出能力为主要特点依靠高攻击力和技能的高伤害倍率，在近距离战斗中能迅速打出高额伤害，瞬间爆发的输出可以对敌人造成致命打击，尤其是在 PK 中，能够快速击杀敌方脆皮职业。/FCOLOR=147>\\<职业特点：战士高爆发  PK力强 适合老板玩家 在跨服战场等PK场景中 可凭借高爆发打出优势/FCOLOR=150>",
	["desc_2"]="<武圣是一个强大的流派  以控制技能为主，干扰敌人，辅助队友进行输出，控制能力强，可以有效干扰敌人，为队友创造输出机会   核心技能开天斩附带冰冻效果  冰冻时间长达两秒！/FCOLOR=147>\\<职业特点：辅助型战士，控制能力超强，中期职业，前期不推荐/FCOLOR=150>",
	["desc_3"]="<坦克是战士职业中的顶级角色，也是队伍中的核心输出和肉盾。其主要职责是冲锋陷阵，吸引敌方火力，并对敌方造成大量伤害，为队友创造输出空间。 逐日剑法附带大量回复效果/FCOLOR=147>\\<职业特点：肉盾型战士  恢复，坦度都是一流  后期职业前期不推荐/FCOLOR=150>",
	["desc_4"]="<符道 抗能打的全能战神，兼顾爆发输出与生存能力，但需较高资源投入。核心技能包括噬血术，具有远程高伤和吸血效果；无极真气，可带来 1.5 倍伤害加成，是团战单挑质变的关键；灵魂火符则作为前期主力输出技能 攻击附带流星火雨 恐怖如斯/FCOLOR=147>\\<职业特点： 发育能力强  群攻技能囊括飓风破以及流星火雨  发育能力比较强 前期推荐 中后期乏力/FCOLOR=150>",
	["desc_5"]="<道尊 精通灵魂火符和禁锢之道为主要特点，属于靠技能禁锢持续输出；符道道士主要通过灵魂火符进行远程攻击，利用火符精通的双重火符效果以及上清雷火符的额外雷电术和麻痹效果，对敌人造成持续的伤害和控制。在团战中，符道可以利用定身咒限制敌方关键人物的行动，为己方团队创造输出环境。/FCOLOR=147>\\<职业特点：pk流  前期不推荐  中后期开始发力/FCOLOR=150>",
	["desc_6"]="<兽神 召唤宝宝为核心，将技能点主要投入到召唤神兽、召唤月灵强化等技能上。通过不断提升这些技能，可大幅提升宝宝的战斗力，利用宝宝的攻击力来输出伤害。在单人练级或探索时，召唤流道士能够依靠召唤生物来应对各种敌人，在团队中也能为队友提供额外的火力支援/FCOLOR=147>\\<职业特点：召唤双白虎 双月灵 能越级打BOSS 获取高级装备机会多 适合单人畅玩 前中后期 推荐 没有乏力期/FCOLOR=150>",
	["desc_7"]="<炎帝 以强化火系输出为主，擅长通过持续的火焰伤害来消耗敌人，还可利用分身术幻化分身一起战斗，提高输出效率 三重流星火雨 附带灼烧伤害  召唤流星直接造成百分比真实伤害/FCOLOR=147>\\<职业特点：爆发性法师  伤害比较高  群怪能力强 升级快 能快速清怪累计资源  前中后期都比较适合/FCOLOR=150>",
	["desc_8"]="<召唤 召唤流法师在战斗中主要依靠召唤兽进行输出和抗伤害，自己则可以在后方进行辅助和控制。例如，可以利用宠物吸引怪物的仇恨，自己则通过释放一些范围魔法技能来清理小怪，或者使用控制技能帮助宠物更好地输出。在面对强大的 BOSS 时，也可以让宠物先进行攻击，自己观察 BOSS 的攻击模式，寻找合适的时机进行输出/FCOLOR=147>\\<职业特点：发育能力比较强  击败boss就可以异化成自己宝宝  前期推荐  后期比较乏力/FCOLOR=150>",
	["desc_9"]="<分身 帝的进阶版，在后期拥有分身术之后坦度进一步增强，一样拥有三重流星火雨 附带灼烧伤害，召唤流星直接造成百分比真实伤害，pk能力数一数二，后期站场法师不二之选/FCOLOR=147>\\<职业特点：爆发力强 群体伤害高 附带真实伤害  分身随时召唤  中后期推荐/FCOLOR=150>",
}
return config;