---alg工作台
---xls转lua table
---本工具免费 交流QQ群:436063587
local config = {
 
	[1] = {
 		["key_name"]=1,
		["itemname"]="紫气东来(紫)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[2] = {
 		["key_name"]=2,
		["itemname"]="紫气东来(气)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[3] = {
 		["key_name"]=3,
		["itemname"]="紫气东来(东)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[4] = {
 		["key_name"]=4,
		["itemname"]="紫气东来(来)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[5] = {
 		["key_name"]=5,
		["itemname"]="兵临城下(兵)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[6] = {
 		["key_name"]=6,
		["itemname"]="兵临城下(临)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[7] = {
 		["key_name"]=7,
		["itemname"]="兵临城下(城)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[8] = {
 		["key_name"]=8,
		["itemname"]="兵临城下(下)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[9] = {
 		["key_name"]=9,
		["itemname"]="金戈铁马(金)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[10] = {
 		["key_name"]=10,
		["itemname"]="金戈铁马(戈)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[11] = {
 		["key_name"]=11,
		["itemname"]="金戈铁马(铁)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[12] = {
 		["key_name"]=12,
		["itemname"]="金戈铁马(马)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[13] = {
 		["key_name"]=13,
		["itemname"]="烽火连城(烽)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[14] = {
 		["key_name"]=14,
		["itemname"]="烽火连城(火)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[15] = {
 		["key_name"]=15,
		["itemname"]="烽火连城(连)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},
	[16] = {
 		["key_name"]=16,
		["itemname"]="烽火连城(城)",
		["decrypt"]="3#30#2|3#35#100|3#36#100|3#37#100",
		["decryptagin_map"]={["声望"]=100,["金刚石"]=2000,},
		["needitem_map"]={["灵符"]=1000,}, 
	},  
}
 return config;