---alg工作台
---xls转lua table
---时间:Tue Jul 15 11:15:59 CST 2025
---本工具免费 交流QQ群:436063587
local config = {
 
	[19] = {
 		["key_name"]=19,
		["needMaterials_map"]={["十转凭证"]=1111,["异界魂石"]=19,},
		["needCurrency_map"]={["灵符"]=100000,},
		["text1"]=45,
		["text2"]=35,
		["text3"]=5,
		["text4"]=10000,
		["buff_map1"]={[67]=4500,[89]=3500,[251]=5,[250]=10000,}, 
	},
	[20] = {
 		["key_name"]=20,
		["needMaterials_map"]={["十转凭证"]=2222,["异界魂石"]=29,},
		["needCurrency_map"]={["灵符"]=200000,},
		["text1"]=50,
		["text2"]=40,
		["text3"]=6,
		["text4"]=20000,
		["buff_map1"]={[67]=5000,[89]=4000,[251]=6,[250]=20000,}, 
	},
	[21] = {
 		["key_name"]=21,
		["needMaterials_map"]={["十转凭证"]=3333,["异界魂石"]=39,},
		["needCurrency_map"]={["灵符"]=300000,},
		["text1"]=55,
		["text2"]=45,
		["text3"]=7,
		["text4"]=30000,
		["buff_map1"]={[67]=5500,[89]=4500,[251]=7,[250]=30000,}, 
	},
	[22] = {
 		["key_name"]=22,
		["needMaterials_map"]={["十转凭证"]=4444,["异界魂石"]=49,},
		["needCurrency_map"]={["灵符"]=400000,},
		["text1"]=60,
		["text2"]=50,
		["text3"]=8,
		["text4"]=40000,
		["buff_map1"]={[67]=6000,[89]=5000,[251]=8,[250]=40000,}, 
	},
	[23] = {
 		["key_name"]=23,
		["needMaterials_map"]={["十转凭证"]=5555,["异界魂石"]=59,},
		["needCurrency_map"]={["灵符"]=500000,},
		["text1"]=65,
		["text2"]=60,
		["text3"]=9,
		["text4"]=50000,
		["buff_map1"]={[67]=6500,[89]=6000,[251]=9,[250]=50000,}, 
	},
	[24] = {
 		["key_name"]=24,
		["needMaterials_map"]={["十转凭证"]=6666,["异界魂石"]=69,},
		["needCurrency_map"]={["灵符"]=600000,},
		["text1"]=70,
		["text2"]=70,
		["text3"]=10,
		["text4"]=60000,
		["buff_map1"]={[67]=7000,[89]=7000,[251]=10,[250]=60000,}, 
	},
	[25] = {
 		["key_name"]=25,
		["needMaterials_map"]={["十转凭证"]=9999,["异界魂石"]=99,},
		["needCurrency_map"]={["灵符"]=900000,},
		["text1"]=80,
		["text2"]=80,
		["text3"]=12,
		["text4"]=80000,
		["buff_map1"]={[67]=8000,[89]=8000,[251]=12,[250]=90000,}, 
	},  
}
 return config;